[{"category":"company","datetime":1710890193,"headline":"News Highlights : Top Company News of the Day - Tuesday at 11 PM ET","id":126589789,"image":"","related":"NVDA","source":"Finnhub","summary":"Apple Looks to External Partners to Boost AI Efforts The iPhone giant is playing catch-up in generative AI boom with the help of Google or OpenAI. Chipotle Board Approves 50-for-1 Stock...","url":"https://finnhub.io/api/news?id=3518f0f927646e7e103875c8269bbc17e1628f98f34a896287d96ccc5e2be712"},{"category":"company","datetime":1710889231,"headline":"Factbox-Key takeaways from Nvidia's annual developer conference","id":126586868,"image":"https://media.zenfs.com/en/reuters-finance.com/66cbd56b21d271e43cfe5266b1fc2811","related":"NVDA","source":"Yahoo","summary":"The chip can run large language models while using 25 times less energy and money than the highly popular Hopper series that helped turn Nvidia into a $2 trillion company.  The chips are expected to hit the market later in 2024, according to CFO Colette Kress.  Nvidia is working with contract chip manufacturer TSMC to avoid holdups in packaging chips, CEO Jensen Huang said.","url":"https://finnhub.io/api/news?id=9b043c5b36af9f8259a637fbddf268897e9bec6281c15805d50bf6f9e10a4f21"},{"category":"company","datetime":1710887294,"headline":"Astera Labs seeks to raise around $713 mln in IPO at $5.5 bln valuation","id":126589256,"image":"","related":"NVDA","source":"Finnhub","summary":"Chip firm Astera Labs on Tuesday set the pricing of its initial public offering of 19.8 million shares at $36 apiece, aiming to raise around$712.8 million. The company priced its IPO...","url":"https://finnhub.io/api/news?id=62d5036bfbca0e9f6952f069dcb02e26e791c18f50070d1848d0fad3336328fd"},{"category":"company","datetime":1710885600,"headline":"Who's Afraid of the Fed's New Dot-Plot?","id":126586869,"image":"https://media.zenfs.com/en/zacks.com/21216ddd468583ae1ace8b8634435d2a","related":"NVDA","source":"Yahoo","summary":"The Dow has its biggest trading session in almost a month, while the S\u0026P 500 notched a fresh all-time closing high.","url":"https://finnhub.io/api/news?id=f8e80ec42cd965ea28af2c22e4315df954f37b604559c4634ce1720c955ffbd0"},{"category":"company","datetime":1710885540,"headline":"Battle of the Super AI Chips: Time to Buy Nvidia or AMD's Stock?","id":126586870,"image":"https://media.zenfs.com/en/zacks.com/f3f6997d2f959f9932a4b5651829a773","related":"NVDA","source":"Yahoo","summary":"Investors may once again be pondering if it's time to buy the recent dip in Nvidia (NVDA) and AMD's (AMD) stock as semiconductor development for artificial intelligence remains in high demand.","url":"https://finnhub.io/api/news?id=399a5578faeea0d42a5563f14aa2a7f00d0836f8341cdad3c0587c5b5d78370a"},{"category":"company","datetime":1710884207,"headline":"AI auto race: Nvidia expands partnership with Chinese EV makers","id":126585028,"image":"https://s.yimg.com/ny/api/res/1.2/igd11hYl6zQFBbg3_Kto7Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/031a7ee0-e634-11ee-bbed-a73fc2847cde","related":"NVDA","source":"Yahoo","summary":"Nvidia (NVDA) announced on Monday that it will be expanding its partnerships with several Chinese EV makers, including BYD (BYDDY) and XPeng (XPEV). These companies will use Nvidia's next generation of in-vehicle chips, called DRIVE Thor. The announcement signals a further push to integrate AI into everyday life. Nvidia Automotive VP Danny Shapiro sits down with Yahoo Finance Tech Editor Dan Howley to discuss Nvidia's expanded partnerships and the implementation of chips in vehicles. Generative AI can be used to assist simulation for testing and validating autonomous vehicles, but it can also be applied inside vehicles, Shapiro says: \"We've been focused on in-vehicle experiences for more than a decade and we pioneered bringing consumer electronics experience into the cockpit: touch screens and digital instrument clusters and rear seat entertainment. The last several years now we've been bringing artificial intelligence to that as well, so having a concierge that you could interact with. Convenience and safety features all built around AI.\"  For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino","url":"https://finnhub.io/api/news?id=80bf00bee10a9fa6050e8dd4d5f56f2b9fccf1df35c3d29a5f48856b9120c2aa"},{"category":"company","datetime":1710884177,"headline":"AMD Fell Today -- Is This a Chance to Buy the Artificial Intelligence (AI) Stock?","id":126586873,"image":"https://g.foolcdn.com/editorial/images/769846/ai-artificial-intelligence-in-circle-on-keyboard.jpg","related":"NVDA","source":"Yahoo","summary":"AMD has slipped recently. What comes next for the AI stock?","url":"https://finnhub.io/api/news?id=e6cd43c192ac21f1af88f1ab49f8af4c773589c348cf384473b62bbcb7c10053"},{"category":"company","datetime":1710883786,"headline":"Dow Jones Futures: Nvidia Leads Upside Reversal; Here Comes Fed's Earnings Report For Market","id":126582142,"image":"https://media.zenfs.com/en/ibd.com/f507e9a69bd7ba001d8325d21822e555","related":"NVDA","source":"Yahoo","summary":"Stocks steadied Tuesday as Nvidia reversed higher. Wednesday's Fed rate-cut outlook is an earnings report for the market rally.","url":"https://finnhub.io/api/news?id=8fc1e3f26708229014eb03df263ff10f27dba1d97918d486646cfb5788e22e45"},{"category":"company","datetime":1710882821,"headline":"Nvidia's Jensen Huang says AI hallucinations are solvable, artificial general intelligence is 5 years away","id":126586874,"image":"https://techcrunch.com/wp-content/uploads/2024/03/GTC-2024-Jensen-Huang-TechCrunch-Haje-Kamps.jpg?resize=1200,675","related":"NVDA","source":"Yahoo","summary":"Artificial General Intelligence (AGI) -- often referred to as \"strong AI,\" \"full AI,\" \"human-level AI\" or \"general intelligent action\" -- represents a significant future leap in the field of artificial intelligence. Unlike narrow AI, which is tailored for specific tasks (such as detecting product flaws, summarize the news, or build you a website), AGI will be able to perform a broad spectrum of cognitive tasks at or above human levels. Addressing the press this week at Nvidia's annual GTC develo","url":"https://finnhub.io/api/news?id=62d575ef7de74f934b06980732c545f2b6d83ff89d32dd8a9a3ff3fb9df935c4"},{"category":"company","datetime":1710881731,"headline":"Nvidia's keynote at GTC held some surprises","id":126586875,"image":"https://techcrunch.com/wp-content/uploads/2024/03/Screenshot-2024-03-19-at-1.36.39 PM.png?resize=1200,792","related":"NVDA","source":"Yahoo","summary":"\"I hope you realize this is not a concert,\" said Nvidia president Jensen Huang to an audience so large, it filled up the SAP Center in San Jose. This is how he introduced what is perhaps the complete opposite of a concert: the company's GTC event. \"You have arrived at a developers conference. There will be a lot of science describing algorithms, computer architecture, mathematics. I sense a very heavy weight in the room; all of a sudden, you're in the wrong place.\" It may not have been a rock co","url":"https://finnhub.io/api/news?id=97394db9206f07584f8c25335e926fe9d88db155b2ec93a52605538f54f72f27"},{"category":"company","datetime":1710881414,"headline":"Stocks Finish With The Dow Gaining 320 Points; Microsoft Adds AI Heavyweights To Roster","id":126582143,"image":"https://media.zenfs.com/en/ibd.com/059344637184c7d9549fffd73fcff3ca","related":"NVDA","source":"Yahoo","summary":"Stocks climbed Tuesday afternoon, with the Dow gaining 320 points. The Nasdaq reversed from lows and rallied after getting help from Nvidia.","url":"https://finnhub.io/api/news?id=474f9cf24994b54c15cd08f307aed7067861fc24eac374a6e1f287081541e884"},{"category":"company","datetime":1710881289,"headline":"Wall Street Analysts See Upside Potential for 10 Stocks with Rising Price Targets","id":126582144,"image":"https://s.yimg.com/ny/api/res/1.2/xtfEN0_KtEaIYq48aJzTLg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/insidermonkey.com/f1ca4c70580f150efd6757c1ec31881e","related":"NVDA","source":"Yahoo","summary":"In this article, we will discuss the 10 stocks whose price targets were recently raised by analysts. If you want to see more such stocks on the list, go directly to Wall Street Analysts See Upside Potential for 5 Stocks with Rising Price Targets. The resurgence in US stocks, buoyed by what’s been labeled the “most-crowded […]","url":"https://finnhub.io/api/news?id=5d02072f37cd7b7b9dc7706d7e8825efb8bae95554e1d7d401365d259b700125"},{"category":"company","datetime":1710881287,"headline":"S\u0026P 500 closes at record high, chip stocks lag","id":126582061,"image":"https://s.yimg.com/ny/api/res/1.2/9UJCyOBqnZ54_vB8kvtCBg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/fad568a0-e631-11ee-b9ff-8d177b921770","related":"NVDA","source":"Yahoo","summary":"Stocks (^DJI, ^GSPC, ^IXIC) closed higher on Tuesday, with the S\u0026P 500 hitting a record high, as investors await the highly anticipated Federal Reserve rate decision scheduled for Wednesday. However, the chip sector missed the broader market trend, closing lower as investors digested the product news from Nvidia's (NVDA) GTC conference. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith","url":"https://finnhub.io/api/news?id=1707c962a9ce64cf65f8b04a88b32dc9c1de2ab400d3f2bd7c2be64062cfa195"},{"category":"company","datetime":1710881125,"headline":"Nvidia Adds AI Smarts To Teradyne Industrial Robots","id":126581487,"image":"https://media.zenfs.com/en/ibd.com/26b3e227e7fae01276e49417cf53f444","related":"NVDA","source":"Yahoo","summary":"Nvidia is bringing AI capabilities to Teradyne's commercial robots, boosting productivity in factories and warehouses.","url":"https://finnhub.io/api/news?id=9a42ffb3d9da7074ad0ba63c720b791e04ab3d00ef0afb5bb6627ee4a1028db1"},{"category":"company","datetime":1710880747,"headline":"Nvidia CEO wants enterprise to think 'AI factory,' not data center","id":126586881,"image":"https://techcrunch.com/wp-content/uploads/2024/03/Screenshot-2024-03-19-at-1.30.00 PM.png?resize=1200,727","related":"NVDA","source":"Yahoo","summary":"In Monday’s keynote at Nvidia's GTC 2024 event, CEO Jenson Huang kept repeating the phrase \"AI factory.\" “In the last Industrial Revolution, the raw material that went into the factory was water,” Huang told TechCrunch in an interview after the keynote. “And the product was electricity.” He was comparing this — turning raw material into something else that have value — to the notion of data centers, which are purely money pits. “There’s a new Industrial Revolution happening in these [server] roo","url":"https://finnhub.io/api/news?id=fa16816ceac7cfffb8d093a908b8ca3d6aa01433483d9fdef5a7863298857e11"},{"category":"company","datetime":1710880737,"headline":"US STOCKS-Wall Street advances with Nvidia and Fed meeting in focus","id":126581410,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","related":"NVDA","source":"Yahoo","summary":"Wall Street's three major indexes closed higher on Tuesday after shares in hotshot chipmaker Nvidia shook off early losses and investors looked ahead to the Federal Reserve's policy meeting conclusion on Wednesday for clues on interest rate policy.  Shares in Nvidia pulled out of the red to close up 1% after it revealed pricing and shipment plans for its hotly anticipated Blackwell B200 artificial intelligence chip, which it says could be 30 times faster than current chips.  Michael James, managing director of equity trading at Wedbush Securities in Los Angeles attributed Tuesday's overall gains to improving sentiment after Nvidia's shares turned around along with ongoing bullishness about the economy's direction.","url":"https://finnhub.io/api/news?id=a18ebf9ce0a21dfb29f6239296c92c0e44a26bb16f8768c72a9700fea9658f12"},{"category":"company","datetime":1710880080,"headline":"These Stocks Moved the Most Today: Nvidia, AMD, Super Micro, Fusion Pharmaceuticals, Nordstrom, International Paper, Tesla, and More","id":126582148,"image":"https://media.zenfs.com/en/Barrons.com/69635aac6be76389c01140d2f324da98","related":"NVDA","source":"Yahoo","summary":"Nvidia rises slightly after the semiconductor company unveils its highly anticipated Blackwell chip, Super Micro files to sell 2 million common shares, and Fusion Pharmaceuticals surges after reaching a deal to be acquired by AstraZeneca.","url":"https://finnhub.io/api/news?id=ffca1ed3f8605890b74df3b1e7aeb4afa35085f70120a4a4d222d1150395c0f2"},{"category":"company","datetime":1710880069,"headline":"Why Nvidia's price action hasn't been 'a knockout blow'","id":126582149,"image":"https://s.yimg.com/ny/api/res/1.2/znPb834Amr9fjPsYRmKJTg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/2c048520-e62b-11ee-af7f-37c4cefff8f3","related":"NVDA","source":"Yahoo","summary":"As Nvidia's (NVDA) GTC conference continues, Moor Insights \u0026 Strategy CEO Patrick Moorhead joins Yahoo Finance Live to discuss the minimal stock reaction to the event. Moorhead believes that although investors expected \"a knockout blow,\" the muted price action reflects investors' concerns about how Nvidia's new products stack up against competitors' offerings. Moorhead notes that Nvidia's new chip is essentially \"two chips stitched together,\" creating a costlier product. While the new lineup may be more expensive, the company will deploy a \"good, better, best\" strategy, keeping all chip variants on the market. Despite Nvidia's dominant market share, Moorhead raises concerns about the sustainability of this position if the company fails to grow its market share further. He suggests that without continued market share growth, it might be challenging for Nvidia to maintain its current dominance. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith","url":"https://finnhub.io/api/news?id=3cb0abcb0c021d17ad1db7a62f66fd7e0d819ed83195dec1db3fb4030ff84c3e"},{"category":"company","datetime":1710879233,"headline":"Move over, Elon Musk: Nvidia says 2024 is the year of the 'humanoid' robot","id":126582152,"image":"","related":"NVDA","source":"Yahoo","summary":"Nvidia CEO Jensen Huang unveiled its Project GROOT during the company's developer conference.","url":"https://finnhub.io/api/news?id=4ad9a3026d1e52bd35a246345e2c4ec70cf25470787513f34892ca714c65d844"},{"category":"company","datetime":1710878483,"headline":"S\u0026P 500 Marks Record Close. Tech Stocks Rebound.","id":126582153,"image":"https://media.zenfs.com/en/Barrons.com/12ea0f43d8f8307249a68d1cb2e0587e","related":"NVDA","source":"Yahoo","summary":"The S\u0026P 500 rose to a record close on Tuesday as traders reacted to Nvidia’s developer conference and looked ahead to the conclusion of the Federal Open Market Committee's March meeting.  The S\u0026P 500 was up 0.6%.  The Nasdaq Composite was up 0.4%.","url":"https://finnhub.io/api/news?id=b100debe5c50ce4b64bbb3dca1ea5ff93a5ef911eb8b83f2fd80efcaebefd039"},{"category":"company","datetime":1710876125,"headline":"Nvidia CEO Sees Artificial General Intelligence Within 5 Years—With a Big Caveat","id":126582154,"image":"https://media.zenfs.com/en/Barrons.com/12ea0f43d8f8307249a68d1cb2e0587e","related":"NVDA","source":"Yahoo","summary":"Nvidia CEO Jensen Huang on Tuesday reiterated his view that he expects to see the emergence of \"artificial general intelligence\" within five years, but, he added, it all depends on how you define the term.  Most people think of AGI as software that is sentient—that can think independently.  Huang's answer suggests that the arrival of AGI might be hard to pin down.","url":"https://finnhub.io/api/news?id=141b4d0c57a849e8d71046a8b02b820fc4a227b6869552ea69b7aac68c6723bf"},{"category":"company","datetime":1710875992,"headline":"What Nvidia’s new Blackwell chip says about AI’s carbon footprint problem","id":126582155,"image":"https://s.yimg.com/ny/api/res/1.2/yZM_PHy.YF0zmcgvJf5mzQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDg-/https://media.zenfs.com/en/fortune_175/20848b9fb2cd76d75bf2d599d1ba5e2b","related":"NVDA","source":"Yahoo","summary":"Nvidia CEO Jensen Huang talking about the energy efficiency of the new Blackwell GPU may be a sign businesses are starting to care about AI's sustainability issues","url":"https://finnhub.io/api/news?id=2003984dd6a41e7f388c74834ef034b6570cf0c88c11770762cec86be4382c91"},{"category":"company","datetime":1710875280,"headline":"Nvidia Plans to Price Newest AI Chips to Appeal to Wide Group of Users","id":126582156,"image":"https://s.yimg.com/ny/api/res/1.2/2L3eo2wo7cah3fDZFCPrkg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/34e28ea9331aaebc17deb40ba1fff8ce","related":"NVDA","source":"Yahoo","summary":"CEO Jensen Huang says the company is positioned to capture a large share of new spending on data centers.","url":"https://finnhub.io/api/news?id=9567bfa15aed2e40e4c7d35905095f2b16304b4c278ca61d4013a306bfe0e977"},{"category":"company","datetime":1710874844,"headline":"Meta does not expect new Nvidia chips to arrive until at least next year","id":126582157,"image":"https://media.zenfs.com/en/reuters-finance.com/519bb5569f825a3061c103ceb17751f5","related":"NVDA","source":"Yahoo","summary":"Facebook owner Meta Platforms is not expecting to receive shipments of Nvidia's new flagship artificial intelligence chip this year, a Meta spokesperson told Reuters.  Nvidia, the dominant designer of GPU (graphics processing unit) chips needed to power most cutting-edge artificial intelligence work, announced the new B200 \"Blackwell\" chip at its annual developer conference on Monday.  The chip maker said the B200 is 30 times speedier at tasks like serving up answers from chatbots, although it did not give specific details about how well it performs when chewing through huge amounts data to train those chatbots, which is the kind of work that has powered most of Nvidia's soaring sales.","url":"https://finnhub.io/api/news?id=3781e13fc0e44770fe413246dbe357437bd5fac8ff805dd17aabb983c601c2e4"},{"category":"company","datetime":1710874479,"headline":"US STOCKS-Wall Street turns higher as Nvidia rebounds, focus on Fed meeting","id":126579393,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","related":"NVDA","source":"Yahoo","summary":"Wall Street's major indexes gained ground on Tuesday with chip stocks paring earlier losses as Nvidia erased losses and investors looked ahead to the Federal Reserve's policy meeting conclusion on Wednesday for clues on interest rate policy.  Shares in chip maker Nvidia rebounded from earlier losses, last trading up 1.7%, after it revealed pricing and shipment plans for its hotly anticipated Blackwell B200 chip artificial intelligence chip, which it says is up to 30 times faster than its current chips.  After Nvidia's announcement late on Monday, rivals such as Advanced Micro Devices and Intel lost ground.","url":"https://finnhub.io/api/news?id=63a6d6885f265fc7e4cd1431e48c3aac19c0e4bd851b1024964959f7e1cf2f16"},{"category":"company","datetime":1710873422,"headline":"Jensen Huang Says Nvidia Needs 'To Create More Resilience in Our Supply Chain'","id":126582159,"image":"https://media.zenfs.com/en/Barrons.com/12ea0f43d8f8307249a68d1cb2e0587e","related":"NVDA","source":"Yahoo","summary":"Nvidia CEO Jensen Huang said Tuesday that the company has to focus on both compliance and resilience when it comes to serving the market in China, given tense geopolitical relationships.  \"There are two things we have to do right away,\" he said at a press conference at the GTC developer event in San Jose.  Huang notes that the company's systems use many parts made in China.","url":"https://finnhub.io/api/news?id=f518fc15606fda54f891a84d3dbb9dddb88c0efc9de812bf8cf8a1987a440697"},{"category":"company","datetime":1710873400,"headline":"Tesco told to change Clubcard logo after losing legal battle with Lidl","id":126579395,"image":"https://www.telegraph.co.uk/content/dam/business/2024/03/19/TELEMMGLPICT000324599433_17108537527160_trans_NvBQzQNjv4BqRbhc5V7kUtrB_UgV-vALC47PRSMmxwY_k-xuJYNqXBk.jpeg?impolicy=logo-overlay","related":"NVDA","source":"Yahoo","summary":"Tesco has lost a bid at the Court of Appeal against a ruling that its Clubcard logo infringed on the trademark of rival supermarket Lidl.","url":"https://finnhub.io/api/news?id=987995c0ad6f06258e17f36c5592f9a8dc87af5f7b0f2f904aa6da22a8004d43"},{"category":"company","datetime":1710853027,"headline":"Stocks to Watch Tuesday: Unilever, Fusion Pharmaceuticals, Nvidia","id":126571385,"image":"","related":"NVDA","source":"Yahoo","summary":"↗️ **Unilever (UL)**, **(UK:ULVR)**: The consumer-goods giant said it plans to spin off its ice-cream business as part of a restructuring that could affect some 7,500 jobs. Its shares in London were up 3%.","url":"https://finnhub.io/api/news?id=2682d488b32b553fc87e619b4a12a69eb29dff9921356759046cac6621f68a71"},{"category":"company","datetime":1710868511,"headline":"NVIDIA Corporation (NVDA) GTC Financial Analyst Q\u0026A - (Transcript)","id":126581757,"image":"https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png","related":"NVDA","source":"SeekingAlpha","summary":"NVIDIA Corporation (NASDAQ:NASDAQ:NVDA) GTC Financial Analyst Q\u0026amp;A Call March 19, 2024 11:30 AM ETCompany ParticipantsJensen Huang - Founder and Chief...","url":"https://finnhub.io/api/news?id=c9ab2a754a653d260536943a59c74c6dc889ac1d119abfa160f87783de814dc1"},{"category":"company","datetime":1710861460,"headline":"News Highlights : Top Company News of the Day - Tuesday at 3 PM ET","id":126578908,"image":"","related":"NVDA","source":"Finnhub","summary":"Microsoft Hires Artificial Intelligence Leader for Consumer-Products Push Mustafa Suleyman helped lead Google's DeepMind, a pioneering artificial intelligence lab. Super Micro plans to sell...","url":"https://finnhub.io/api/news?id=f294f97ceea8b9a6c4ba2614816cc622769d1dd50f155e6096d5f6ae447a2469"},{"category":"company","datetime":1710860959,"headline":"Dell Has Untapped Upside Risk","id":126578995,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/181792558/image_181792558.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"Dell Technologies Inc. is experiencing a sequential improvement in their ISG and CSG segments. Click here for more on DELL stock prospects.","url":"https://finnhub.io/api/news?id=90d9c4b3e8b999beac721ef75ce7038caa7908f9005ef1f3cb3fb21c2b9dab07"},{"category":"company","datetime":1710857844,"headline":"How Blackwell architecture 'sets the stage' for Nvidia's AI leadership","id":126572294,"image":"https://s.yimg.com/ny/api/res/1.2/_F2ZTdiDdNZ4DDyAUZ8l6w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/41c27590-e5f7-11ee-befb-769b0f0c7ebe","related":"NVDA","source":"Yahoo","summary":"Nvidia's (NVDA) Monday AI conference garnered glowing reviews, with the tech giant unveiling promising new products that have captured the industry's attention. TECHnalysis Research President Bob O'Donnell joins Yahoo Finance Live to provide insight into the tech giant's releases. O'Donnell likens the Nvidia conference to \"a rock concert.\" He commends Nvidia for \"delivering on what they promised.\" Although the markets may not be reacting as investors had hoped, he stresses that the company's new Blackwell architecture \"sets the stage\" for Nvidia to maintain its leadership in the AI realm. O'Donnell highlights Nvidia's release of its NIMS technology, which he states will provide companies with software that eases the process of building generative AI applications. This development opens up new opportunities for companies to venture into the AI space and further establishes Nvidia as a software provider, unlocking \"more revenue sources.\" O'Donnell notes that Nvidia's new software releases are designed to empower \"regular companies\" that may not have the same resources and data scientists as larger companies, enabling them \"to be able to pull some of this stuff off.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith","url":"https://finnhub.io/api/news?id=e9c22bd620e1fc36784e28c11d5c35fc82732099681ab1675936f6b7496c40cf"},{"category":"company","datetime":1710857516,"headline":"US STOCKS-S\u0026P 500, Nasdaq fall in lead-up to Fed meeting; chip stocks down","id":126572295,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","related":"NVDA","source":"Yahoo","summary":"The S\u0026P 500 and the Nasdaq fell on Tuesday with most megacap and chip stocks weakening, while sentiment remained fragile ahead of the Federal Reserve's March policy meeting.  Investor darling Nvidia fell 3.0% after the company unveiled the Blackwell B200, an AI chip it says is up to 30 times faster than its previous chip.","url":"https://finnhub.io/api/news?id=dad2ff436f45ae18ffd750b6854486e1ad5776c9af8b96b77438bf9581d80036"},{"category":"company","datetime":1710857220,"headline":"Prediction: Nvidia Will Become the World's Largest Company. Here's Why.","id":126572296,"image":"https://g.foolcdn.com/editorial/images/769546/nvda-nvidia-market-cap-money-investing.jpg","related":"NVDA","source":"Yahoo","summary":"You don't need a crystal ball to see that Nvidia is rapidly closing the gap on Microsoft and Apple.","url":"https://finnhub.io/api/news?id=8e87f96d4d55f1cc26ac6b4d6f847500a5eb16b0dbe74a1cf74d0ba0f4a87811"},{"category":"company","datetime":1710856907,"headline":"Nvidia GTC: In-depth look at new product lineup","id":126572297,"image":"https://s.yimg.com/ny/api/res/1.2/9bb47GPEV6n6pMvUMnhLtA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/32288000-e5f4-11ee-bf9c-f26bc811bce2","related":"NVDA","source":"Yahoo","summary":"Shares of Nvidia (NVDA) are trading lower on Tuesday following the company's highly anticipated AI Conference. During the event, CEO Jensen Huang unveiled Nvidia's new product lineup, which includes the groundbreaking Blackwell GPU architecture, the cutting-edge GB200 superchip, and the innovative GROOT humanoid robot software. Yahoo Finance's Tech Editor Dan Howley breaks down the details and applications of each product released by Nvidia. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith","url":"https://finnhub.io/api/news?id=c5f624742e002922c258b81a2d45a94e2643c2d50c4b01e36a3015af5e8576a3"},{"category":"company","datetime":1710856490,"headline":"Nvidia's Blackwell, FOMC, Bank of Japan: 3 things","id":126572298,"image":"https://s.yimg.com/ny/api/res/1.2/v10.8fuyPYGE_m5_gWJlYA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://s.yimg.com/os/creatr-uploaded-images/2024-03/211bce50-e5f6-11ee-afff-996dfce12c9f","related":"NVDA","source":"Yahoo","summary":"During Nvidia's (NVDA) GTC event on Monday, CEO Jensen Huang announced the company's next generation \"Blackwell\" GPU architecture. He also revealed the company's new GB200 processor, referring to it as the world's most powerful chip. Stock Futures are trading lower on Tuesday morning as the Federal Open Market Committee (FOMC) begins its two-day policy meeting, with many on Wall Street expecting the committee to make no changes to interest rates. Investors eagerly await the Fed Dot Plot, which outlines how Fed leadership expects interest rates to be cut going forward. The Bank of Japan has raised borrowing costs for the first time in 17 years. Japan has finally ended 8 years of negative interest rates by setting a new policy rate between 0-0.1%. Yahoo Finance Reporters Dan Howley, Josh Schafer, and Akiko Fujita break down the latest developments. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino","url":"https://finnhub.io/api/news?id=1168016d580298b538bbcc5c11a5d9bf375307dc342f69e7e0965c80dc46d72b"},{"category":"company","datetime":1710855209,"headline":"Spire Global Spikes On Nvidia Partnership For AI-Driven Weather Forecasts","id":126572299,"image":"https://media.zenfs.com/en/ibd.com/5b5160ea2c78d53359424f66816fcd04","related":"NVDA","source":"Yahoo","summary":"Russell 2000 component, space data company Spire Global spikes on Nvidia partnership for AI weather forecasts.","url":"https://finnhub.io/api/news?id=f58c8559ce1e2e5ba89f21980d3b118c3288d9a55a517e359fbb710173c529b7"},{"category":"company","datetime":1710853678,"headline":"Nvidia Is A Step Or Two Ahead Of AI Chip Rivals: Analyst","id":126572300,"image":"https://media.zenfs.com/en/ibd.com/d45c0ab47a3744daf4ea121fcaa99ef3","related":"NVDA","source":"Yahoo","summary":"Nvidia wowed Wall Street with the breadth and depth of its artificial intelligence technologies announced late Monday.","url":"https://finnhub.io/api/news?id=7857f1fd12b3c5ea2370496d57a82601c4da1fddeebb0b46131658480fa1fefd"},{"category":"company","datetime":1710853200,"headline":"2 Reasons to Buy Nvidia Stock Like There's No Tomorrow","id":126572302,"image":"https://g.foolcdn.com/editorial/images/767244/ai-on-a-computer-chip.jpg","related":"NVDA","source":"Yahoo","summary":"Growth in artificial intelligence (AI) is coming from much more than just machine learning.","url":"https://finnhub.io/api/news?id=31b905ecfde7a92c6d9bf873549680272db8f7efcb311174a513ef2034286036"},{"category":"company","datetime":1710853200,"headline":"Jensen Huang outlines a huge future for Nvidia","id":126572301,"image":"","related":"NVDA","source":"Yahoo","summary":"The Nvidia boss wows attendees at the company's developers conference with an expansive artificial intelligence vision.","url":"https://finnhub.io/api/news?id=c9ffe890228b05d4bb14f98ee48d48531585f3ead6b7e3c704f1385f292dcfef"},{"category":"company","datetime":1710852722,"headline":"Secure by Design: NVIDIA AIOps Partner Ecosystem Blends AI for Businesses","id":126575082,"image":"","related":"NVDA","source":"Finnhub","summary":"In today's complex business environments, IT teams face a constant flow of challenges, from simple issues like employee account lockouts to critical security threats. These...","url":"https://finnhub.io/api/news?id=9d4f6f4babf002d69464fc229cad7653a6078aa66c6e287ffb9ac03d2d443e07"},{"category":"company","datetime":1710852531,"headline":"RPT-US STOCKS-Futures dip as focus turns to Fed meeting","id":126572303,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","related":"NVDA","source":"Yahoo","summary":"Wall Street's main stock indexes were set to open lower on Tuesday as investors braced for the Federal Reserve's March policy meeting and chip stocks weakened.  All three major stock indexes finished higher in the previous session, with the Nasdaq bouncing back from two successive small weekly losses as growth stocks such as Alphabet and Tesla boosted the tech-heavy index.  Most megacap growth stocks were under pressure in premarket trading.","url":"https://finnhub.io/api/news?id=524517d5ee157b53dafed9acabc50a3ebc1fecd73cc5205cd3a440a0f5477130"},{"category":"company","datetime":1710852000,"headline":"SAP \u0026 NVIDIA Unite to Advance AI in Enterprise Solutions","id":126572304,"image":"https://media.zenfs.com/en/zacks.com/cd9ed8cf63fa5a7bc41c5e977c67cccb","related":"NVDA","source":"Yahoo","summary":"SAP and NVIDIA are set to offer quick access to a wide variety of LLMs and support reliable and ethical business AI.","url":"https://finnhub.io/api/news?id=9948657dc1d53182e4a42a903df340e8b085e4e8f3df64874afdf8b4dba6ac61"},{"category":"company","datetime":1710851941,"headline":"US STOCKS-Futures dip as focus turns to Fed meeting","id":126572305,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","related":"NVDA","source":"Yahoo","summary":"Wall Street's main stock indexes were set to open lower on Tuesday as investors braced for the Federal Reserve's March policy meeting and chip stocks weakened.  All three major stock indexes finished higher in the previous session, with the Nasdaq bouncing back from two successive small weekly losses as growth stocks such as Alphabet and Tesla boosted the tech-heavy index.","url":"https://finnhub.io/api/news?id=f43f3eb1468de38c31b2e738978a0e84d3e84a3ad5248b73cac509ec62b5327c"},{"category":"company","datetime":1710851940,"headline":"NetApp (NTAP) \u0026 NVIDIA to Advance RAG for AI Applications","id":126572306,"image":"https://media.zenfs.com/en/zacks.com/306e94007e8260e95ff74a73f05e6f54","related":"NVDA","source":"Yahoo","summary":"NetApp (NTAP) collaborates with NVIDIA to allow customers to \"talk to their data\" and obtain proprietary business insights.","url":"https://finnhub.io/api/news?id=7cc7c335ad69aa15feaaa347dab0b92776589f01801b70afd28b1b53342a2fab"},{"category":"company","datetime":1710851760,"headline":"Wall Street Lunch: Help Me George Lucas, You're My Only Hope","id":126574694,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1170721739/image_1170721739.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"Major Disney shareholder George Lucas backs Bob Iger in proxy battle. Nvidia sees sell-the-news reaction to GTC. EV maker Fisher halts production as it fights to survive.","url":"https://finnhub.io/api/news?id=5bed0d1194ca9eb0cb1472feebbac42c33cdfcd882c433c866da042a4059607f"},{"category":"company","datetime":1710851332,"headline":"Nvidia’s Announcements Are Applauded by Wall Street","id":126572307,"image":"https://s.yimg.com/ny/api/res/1.2/tJRKi0ocH7TsMiFsS9NA_Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/df2ef35c250a4f933a843e21b668a8a4","related":"NVDA","source":"Yahoo","summary":"If the initial stock-market reaction to Nvidia’s GTC conference has been underwhelming, Wall Street is still backing the chip maker.  “We continue to be impressed with the company’s full-stack strategy and product offerings including chips, hardware platforms, software, and microservices,” wrote Raymond James analyst Srini Pajjuri in a research note on Tuesday, reiterating a Strong Buy rating on Nvidia stock with no target price.  Pajjuri said he expects Nvidia can raise its average selling price for the new Blackwell chips by between 50% and 60% against the current top-range H100, which was being sold last year for $25,000-$30,000 each.","url":"https://finnhub.io/api/news?id=4d71b0d78a436c4eaaebc3a95c76a3c40388338e9ba12eae198b58cab1c120a5"},{"category":"company","datetime":1710850798,"headline":"Nvidia: BofA maintains buy recommendation, target price $1100","id":126574299,"image":"","related":"NVDA","source":"Finnhub","summary":"Bank of America on Tuesday maintained its Buy recommendation on Nvidia, with a price target of 1100 dollars, the day after the first announcements made at the GTC conference for AI developers.While...","url":"https://finnhub.io/api/news?id=7fb9fee481d9e4e2c385da1e015a40ec3c2c666ac7f5f6685f90f5bb638d06e9"},{"category":"company","datetime":1710850330,"headline":"NVIDIA : GTC Financial Analyst Q\u0026A Presentation","id":126574047,"image":"","related":"NVDA","source":"Finnhub","summary":"GTC Financial Analyst Q\u0026A Jensen Huang, CEO \u0026 Colette Kress, CFO | March 19, 2024 Except for the historical information contained...","url":"https://finnhub.io/api/news?id=5ed31e3acabec796bf0d7ae1e7547c97bceb4442ebe437fda7587ecff4752777"},{"category":"company","datetime":1710848520,"headline":"Jensen Huang Says Nvidia Is Not Just A Chipmaker, Puts $2T Valuation Up Against $100T AI Opportunity","id":126574986,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=6bc98381da26228c6453af2a5b99c004f6b4a30ecab4aec22e550497485d63e9"},{"category":"company","datetime":1710848280,"headline":"Wall Street Mixed As Tech Stocks Fall, Fed Meeting Begins","id":126574987,"image":"","related":"NVDA","source":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=95181e068ee9712820a2c632b647879c00ff44fedbf62329095c340160f702cc"},{"category":"company","datetime":1710848040,"headline":"These Stocks Are Moving the Most Today: Nvidia, Synopsys, Super Micro Computer, Fusion Pharmaceuticals, Tesla, XPeng, and More","id":126570341,"image":"https://media.zenfs.com/en/Barrons.com/69635aac6be76389c01140d2f324da98","related":"NVDA","source":"Yahoo","summary":"Nvidia falls after the semiconductor company unveils its highly anticipated Blackwell chip, while Fusion Pharmaceuticals surges after reaching a deal to be acquired by AstraZeneca.","url":"https://finnhub.io/api/news?id=2c9082d8cad1862d864f790ab55492326b9f43202fb458c8b151f1f5f960a29f"},{"category":"company","datetime":1710847800,"headline":"Nvidia To Extends Its AI Dominance – Momo Turns Nvidia Into A Casino - Sell The News Reaction","id":126574928,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=a94b60f43fd40b2b8bbbec3bf2d2a8384e1304fddfe02f1422bac32573c1b5fb"},{"category":"company","datetime":1710847680,"headline":"NVDA Stock Prediction: Still on the Path to $1,000 Per Share","id":126574992,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=80e5e4ba26055d2595803dabc83bcd00d440e908eb53e98d81ef5738e00c9e5e"},{"category":"company","datetime":1710847237,"headline":"Intel: CEO Gelsinger Fulfilling The Goals While Reducing Uncertainty","id":126573252,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/458625657/image_458625657.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"Intel's capital allocation strategy and funding methods are supporting its growth and innovation plans. Read why I rate INTC stock as a Buy.","url":"https://finnhub.io/api/news?id=c8e5727b2fb2fe4b07764c1ae556558839ff18721a9b2c51a39bb2fae3a5e6b7"},{"category":"company","datetime":1710847020,"headline":"AI mania hits Wall Street as Morgan Stanley creates new role focused on the trend","id":126574930,"image":"","related":"NVDA","source":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=b9c2aecf274a5d3d995de83e398fc78372b9178f04fc28ea3a3c7d11a82e22a9"},{"category":"company","datetime":1710846900,"headline":"NVIDIA Unveils Next-Gen AI Supercomputer and Processor, Fueling Growth","id":126574998,"image":"","related":"NVDA","source":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=3b3fd78884c95bf45c052797ff8c14b007b77f2e8560fd89e4015130acea8d8d"},{"category":"company","datetime":1710846840,"headline":"Nvidia slips even as Wall Street commends 'impressive' GTC keynote; chips follow","id":126574117,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=ec4bc1d244a9d25b3cb57f0606f74d96f071b817e2e624865b755bb27d56cc7f"},{"category":"company","datetime":1710846495,"headline":"Nvidia's new AI chip to be priced at over $30,000, CNBC reports","id":126572989,"image":"","related":"NVDA","source":"Finnhub","summary":"Chip designer Nvidia'slatest Blackwell B200 artificial intelligence chip will costbetween $30,000 and$40,000, CEO Jensen Huang told CNBC onTuesday.(Reporting by Arsheeya Bajwa in Bengaluru;...","url":"https://finnhub.io/api/news?id=111e47d9417442293df4d144a4ade6c225c5825ac52db4f8a59d475170991cef"},{"category":"company","datetime":1710846360,"headline":"Nvidia’s (NASDAQ:NVDA) New Chip Line Fails to Impress","id":126575000,"image":"","related":"NVDA","source":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=8332f43a625344716f749e673c746c66734558f899097a05c4b5fda7964e18bd"},{"category":"company","datetime":1710846180,"headline":"Micron Q2 earnings preview: Artificial Intelligence Love","id":126574015,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=35f81dd7228653ac44371768f63b7beae6bf245356d18b5ee7cf66afdb20a0c4"},{"category":"company","datetime":1710846120,"headline":"What You Missed On Wall Street This Morning","id":126574090,"image":"","related":"NVDA","source":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=8a1e2d477f54625efb6376da6c6101cb2d81aa13ee6d3bb138004f1a7887aaa5"},{"category":"company","datetime":1710846048,"headline":"My Top-5 Disruptive AI Stock Picks For Intelligent Investing","id":126572936,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1494143619/image_1494143619.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"My top-5 disruptive AI stock picks include promising software companies as well as Tesla. All five have invested deeply in AI and appear to have long growth runways.","url":"https://finnhub.io/api/news?id=ee37d63e66806f40ca47617f11c8ea5ef215bacdaf3aedd71be1cf78d671f4e9"},{"category":"company","datetime":1710844800,"headline":"Why Are Stocks Down Today?","id":126575006,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=2314eef54ce6a9157b78be3485b8446b56e8d53e69fb819a3a009eafb136d82c"},{"category":"company","datetime":1710844200,"headline":"Will Tesla Lose Its Spot In The Magnificent Seven?","id":126574935,"image":"","related":"NVDA","source":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=633ba20c3cfb169e63d551d9a61a30580538f9f4d464641f098c849f0da02335"},{"category":"company","datetime":1710844140,"headline":"Beyond the Big Three: 3 Attractive Retail Stocks Winning the Delivery Game","id":126575009,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=5e79282945bc24c17a1f1be5bc3abca279cac36fbe155c0f3ba5f474353ff996"},{"category":"company","datetime":1710843600,"headline":"Semiconductor Slump: A Day Of Losses For AMD, NVDA, And SMCI","id":126575013,"image":"","related":"NVDA","source":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=57be853ba58b81826e4ceeac360e50f7f20cf82fc092087fc650d0bd5e7080aa"},{"category":"company","datetime":1710843540,"headline":"JWN Stock Alert: Nordstrom Family Enters New Bid to Take Retailer Private","id":126575014,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=7d96ee94ad0feee57961fabf9ef94d56d98a1aa847653bc404e2c101ec8465f1"},{"category":"company","datetime":1710843000,"headline":"Nvidia slips as Wall Street digests Blackwell architecture unveiling","id":126574118,"image":"","related":"NVDA","source":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=85118237ede95c4943954c01c2afcffec0edd5fad794eaafe53b6110169028c9"},{"category":"company","datetime":1710842820,"headline":"Nvidia’s parabolic uptrend is neither over-valuated nor overbought - Fundstrat","id":126575017,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=8f63bb284aeb8a94e1be40be39cd8ee715f21766a531ced75f199b04a8ccf6f0"},{"category":"company","datetime":1710842580,"headline":"Can Nvidia Take Synopsys (SNPS) Stock to the Next Level?","id":126575021,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=31417ea6b8e5c3558a2d6e33282f1f38a6f52cc7a050f38e6124ab123d51380f"},{"category":"company","datetime":1710842580,"headline":"Check Point, Nvidia collaborate to enhance security of AI cloud infrastructure","id":126575020,"image":"","related":"NVDA","source":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=0f2b567968a3ebe6c229818c4648029e94795fb4470f31f9f8b0c96cfc3d0a30"},{"category":"company","datetime":1710842400,"headline":"Nvidia Advances GenAI Adoption","id":126572106,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1581814409/image_1581814409.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"At its first in-person GTC conference in 5 years, Nvidia unveiled a next-gen reinvention of the underlying architecture that has made its GPU chips an important part of the GenAI revolution.","url":"https://finnhub.io/api/news?id=7b59a61d37445a6ee03b09d5e22bbb7d44fd3e1411f581acf45fa4f719c8446f"},{"category":"company","datetime":1710842280,"headline":"How Nvidia GTC 2024 Can Supercharge NVDA Stock","id":126575023,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=3dda3e2b08471b7c6436797626882fe431a2ef12d66d6b6e12a3a3ad3274656d"},{"category":"company","datetime":1710842280,"headline":"Inverse Cramer Strikes Again? Nvidia Opens 3% Lower After 'Mad Money' Host Poses With 'Pals': Internet Says 'Shorting Robots'","id":126575022,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=cc40b0bae3dfb9b8e59d7ad6c14af661242b8d8aa29ac59e25f931322c1e2f7e"},{"category":"company","datetime":1710841440,"headline":"Market Clubhouse Morning Memo - March 19th, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, And TSLA)","id":126574119,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=7ae41c31d71654b23ca5fa1c59b8ff4df4f5c93f5b4fc3209a7498c9e06296c1"},{"category":"company","datetime":1710841260,"headline":"Barclays has 'positive take' on Supermicro after Nvidia Blackwell GPU unveiling","id":126575025,"image":"","related":"NVDA","source":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=7205e349a920b7e64b4bbfebca79ee3e91a8bd03d1e4f0cb12777c3dfdef44f4"},{"category":"company","datetime":1710841020,"headline":"ALAB Stock IPO: Astera Labs Is Heating Up Ahead of March 20 Debut","id":126574821,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=b97248d6bfce23e672f14ee3c4fa2cca5c411026e657e7caabe65e86482c7fa7"},{"category":"company","datetime":1710840960,"headline":"Nvidia’s stock shrugs off its ‘Taylor Swift’ moment. Here’s why bulls are still cheering.","id":126575027,"image":"","related":"NVDA","source":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=7c770ccb3c1576344b4245d754dc78c1cb7d2e9d2fa8ad37a573b060b42f8154"},{"category":"company","datetime":1710840540,"headline":"NVIDIA's (NVDA) CEO Keynote Boosts Partner Stocks Despite Own Stock Dip","id":126573878,"image":"","related":"NVDA","source":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=0f8e7254a4d3bb23a6370507a6d1dcdc39d4eca91f4d2aa78776b0c523d5be67"},{"category":"company","datetime":1710840145,"headline":"Smarter AI for All Lenovo Unveils Hybrid AI Solutions that Deliver the Power of Tailored Generative AI to Every Enterprise and Cloud in Collaboration with NVIDIA","id":126571498,"image":"","related":"NVDA","source":"Finnhub","summary":"Today, at NVIDIA GTC, a global AI conference, Lenovo announced new hybrid AI solutions, built in collaboration with NVIDIA, that deliver the power of tailored generative AI applications to every...","url":"https://finnhub.io/api/news?id=9ad0cf71ee8a2bd7ae29c353f5acbabd13c7fa950be56925fca53531d66db391"},{"category":"company","datetime":1710839867,"headline":"News Highlights : Top Company News of the Day - Tuesday at 9 AM ET","id":126571398,"image":"","related":"NVDA","source":"Finnhub","summary":"Ben \u0026 Jerry's Owner Loses Its Taste for Ice Cream Unilever plans to spin off its ice-cream business and could consider a sale, with 7,500 jobs potentially being affected. Pfizer to Raise...","url":"https://finnhub.io/api/news?id=986d006a189b62c7dfcac04529b33b8e8ab38a3add25d22172509a402d7ebc2f"},{"category":"company","datetime":1710839821,"headline":"News Highlights : Top Global Markets News of the Day - Tuesday at 9 AM ET","id":126571372,"image":"","related":"NVDA","source":"Finnhub","summary":"Yen Weakens; Dow Futures Fall Futures tied to the S\u0026P 500, the Dow and the Nasdaq-100 pointed down while overseas markets were mixed. Canada Inflation Unexpectedly Cools to 2.8% in February...","url":"https://finnhub.io/api/news?id=adba7ba5d8d4f0c7a15ea4e0aad5573074f996fb353a95ef7a42bcb2b429e410"},{"category":"company","datetime":1710839662,"headline":"AMD Vs. Intel: Who Is Winning In CPUs?","id":126571403,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1989493769/image_1989493769.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"AMD and Intel compete fiercely in CPU market for PCs and servers, with Intel leading desktops and AMD leading servers. See why we rate AMD stock as a buy.","url":"https://finnhub.io/api/news?id=dfeebd8e554246e455916989e69bf65958a76655127c0285e404665172cb7a65"},{"category":"company","datetime":1710839400,"headline":"Biggest stock movers today: SMCI, JWN, FUSN, NCMI, crypto stocks and more","id":126574037,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=c6e2e1eaa616e20b7ee57cc27f40e5bf0588f2ffa62080ab838461eb40a4e694"},{"category":"company","datetime":1710839220,"headline":"7 AI Cryptos to Turn $10,000 Into $1 Million","id":126575032,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=06446c582f4e6ee2547cbea3ea50aed3785e03277d9a6d73987950e6ede96b5a"},{"category":"company","datetime":1710838980,"headline":"Biggest stock movers today: SMCI, FUSN, NCMI, crypto stocks and more","id":126574038,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=89b988649f6122a9f45d1bb44ac798586f1c2692edfe2edbb938bb4c31979a6b"},{"category":"company","datetime":1710837541,"headline":"Futures dip as focus turns to Fed meeting","id":126570999,"image":"","related":"NVDA","source":"Finnhub","summary":"Wall Street's main stock indexeswere set to open lower on Tuesday as investors braced for theFederal Reserve's March policy meeting and chip stocks weakened. All three major stock...","url":"https://finnhub.io/api/news?id=0d6419e0331f0f515ce0fe70bd7c987b7c030427db8954e66d30f40121be5a75"},{"category":"company","datetime":1710837000,"headline":"Nvidia's Blackwell GPUs Set New Standards In AI Computing Power And Market Dominance - Will Their Stock Surpass The Elusive $1000 Mark?","id":126575036,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=5877465172eace32cd21a2b354eca026bf907ddd096415ead4f69ab489db3fef"},{"category":"company","datetime":1710836640,"headline":"Marvell unlikely to be impacted by Nvidia change: Oppenheimer","id":126575039,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=13f8431fe7434fbd98df5ff7ae339942dc0bd8cd5aaf964526a05949ef75fe6f"},{"category":"company","datetime":1710836640,"headline":"4 stocks to watch on Tuesday: NVDA, UL and more","id":126575037,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=aa1ce6d003173d2485aeb7efb203a72894300961ba1a87f0923a33aeae1fdcda"},{"category":"company","datetime":1710836400,"headline":"Apple Vision Pro Gets Nvidia Boost With Dedicated Data Centers To Stream Advanced 3D Experiences","id":126574938,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=b8210d468b1964d35907e3e6da46675c1de9232a4507afece607208fdb15b338"},{"category":"company","datetime":1710836340,"headline":"Marvell unlikely to be impacted Nvidia change: Oppenheimer","id":126575042,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=845de3eec9dc28673783c359c852a1dc72c5012cf7c7da3c2222621f38ca2392"},{"category":"company","datetime":1710835920,"headline":"AI mania hits Wall Street as Morgan Stanley creates role focused on the trend","id":126574939,"image":"","related":"NVDA","source":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=74d4d606d94d2b35fb3b0fd3bc8d6de32ff0dd3bd2e3e7341049c6b2af2e8784"},{"category":"company","datetime":1710835260,"headline":"Bank of Japan Ends Negative Interest Rate Policy, Yen Reacts","id":126574123,"image":"","related":"NVDA","source":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=5e84370c5ed9f3a2cc5809a7606e93cd8aa9dc3601f05895d39eedfe0ca3a366"},{"category":"company","datetime":1710834900,"headline":"Notable open interest changes for March 19th","id":126574124,"image":"","related":"NVDA","source":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=acece34a823e7cc0704061ac9050d9b7ad65217af1f49415625edb9577dd4c36"},{"category":"company","datetime":1710834840,"headline":"Small-Cap Slam Dunks: 3 Russell 2000 Stocks to Own This March","id":126574966,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=04ed298dcbed93ec042056de95b00efdeeaed6a10eab5f0274e82905aa9a4fd4"},{"category":"company","datetime":1710834840,"headline":"Fly Intel: Pre-market Movers","id":126574104,"image":"","related":"NVDA","source":"Thefly.com","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=ed2bf965d645154a2a87923e83bb3736ca54b94cbec4ed7d4219e38237f8ef46"},{"category":"company","datetime":1710834000,"headline":"Nvidia To Rally Around 10%? Here Are 10 Top Analyst Forecasts For Tuesday","id":126573842,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=f5db934afcd58e7a95511c999bd8594bce6d1565305536e8dcd6fae2a3448b41"},{"category":"company","datetime":1710833460,"headline":"Morning Brew: AstraZeneca Acquires Fusion Pharma in $2.4B Deal, Shaking Up Radiopharmaceuticals","id":126575052,"image":"","related":"NVDA","source":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=514e223ad070097a2c9bcdb4a0a388523cfec57d25f69408ffcbaccf47f09dad"},{"category":"company","datetime":1710833160,"headline":"Nvidia slips even as Wall Street commends 'impressive' GTC keynote","id":126574125,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=e67f8d495af2be10e41f0f07c3b0ad000e1614165c84705ae83ec067fddf4fe4"},{"category":"company","datetime":1710832645,"headline":"News Highlights : Top Global Markets News of the Day - Tuesday at 7 AM ET","id":126569899,"image":"","related":"NVDA","source":"Finnhub","summary":"Nvidia, Synopsys, Fusion Pharmaceuticals, Tesla, XPeng, National CineMedia, and More Stock Market Movers Nvidia falls after the semiconductor company unveils its highly anticipated Blackwell...","url":"https://finnhub.io/api/news?id=0b8da8e132518322cc841af294ba35308a693ff968035f9a0b977b0d1006e0cd"},{"category":"company","datetime":1710832617,"headline":"News Highlights : Top Company News of the Day - Tuesday at 7 AM ET","id":126569905,"image":"","related":"NVDA","source":"Finnhub","summary":"Pfizer to Raise Around $4.27 Billion From Haleon Shares Sale Pfizer is raising around $4.27 billion from the sale of part of its stake in consumer-healthcare business Haleon. Ben \u0026 Jerry's...","url":"https://finnhub.io/api/news?id=3452dc842f41e6fb333cd1488ac7421e0e78f7c0ef343e7515766629f958832f"},{"category":"company","datetime":1710829137,"headline":"Red-hot Nvidia dips after it unveils new AI chip","id":126569333,"image":"","related":"NVDA","source":"Finnhub","summary":"Nvidia shares dipped in premarket trading on Tuesday after having more than tripled in value in the past year, as the dominant AI chip supplier unveiled its latest flagship product that is...","url":"https://finnhub.io/api/news?id=69027e98958e1094b9a219ccff410f876140f79c8285ae92dc8c4e74858b8693"},{"category":"company","datetime":1710824311,"headline":"Singtel to Launch Nvidia-Powered Cloud Computing Offering","id":126568519,"image":"","related":"NVDA","source":"Finnhub","summary":"By Kimberley Kao Singtel is launching a Nvidia-powered cloud-based solution in the third quarter, offering enterprises access to accelerated computing power in Singapore and the broader...","url":"https://finnhub.io/api/news?id=575b3a914d1c2db57d999cc5883426068103a3c92845124cee43bd04254fb000"},{"category":"company","datetime":1710824131,"headline":"Denmark to Build AI Supercomputer to Accelerate Innovation","id":126568500,"image":"","related":"NVDA","source":"Finnhub","summary":"By Dominic Chopping Denmark is establishing a national center for artificial intelligence innovation that will house a new AI supercomputer to accelerate research and innovation in areas such...","url":"https://finnhub.io/api/news?id=86175e9bfa73646f65c6afc0cd95002418c85099204b34962c7741cde7bcfec3"},{"category":"company","datetime":1710818536,"headline":"Nvidia supplier SK Hynix begins mass production of next generation memory chip","id":126565799,"image":"https://media.zenfs.com/en/reuters-finance.com/7fdc65eaeb1bbdf977fb099d2959bf81","related":"NVDA","source":"Yahoo","summary":"SK Hynix Inc said on Tuesday it has begun mass production of next-generation high-bandwidth memory (HBM) chips used in artificial intelligence chipsets, with sources saying initial shipments will go to Nvidia this month.  Last month, Micron Technology said it had started mass production of the chips while Samsung Electronics said it had developed the industry's first 12-stack HBM3E chips.  SK Hynix has, however, led the HBM chip market by virtue of being the sole supplier of the version currently used - the HBM3 - to Nvidia which has 80% of the market for AI chips.","url":"https://finnhub.io/api/news?id=9e74cba87a96fe90077cddbb2d545f06351c6a74498ff7c839bfbfcf40f7ad14"},{"category":"company","datetime":1710814486,"headline":"Japan's Nikkei slides before BOJ decision as chip shares weigh","id":126565098,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","related":"NVDA","source":"Yahoo","summary":"Many semiconductor-related shares had outsized losses, after Nvidia's annual developer conference failed to provide fresh momentum for the global artificial intelligence-centred chip stock rally.  Energy shares were the top performers, after a 2% jump in crude oil prices overnight.  The Nikkei slipped 0.8% to 39,429,73, as of 0130 GMT, giving up some of Monday's 2.7% surge, when investors cheered media reports offering further insight on what BOJ policymakers would do on Tuesday.","url":"https://finnhub.io/api/news?id=b24c5c02c77f4a77a867694aba2a7a506f38d0adf9168dae23cb7876957ddaaa"},{"category":"company","datetime":1710808370,"headline":"Dow Jones Futures Fall: Nvidia CEO Speech In Focus; Google, Tesla Surge Ahead Of Fed Meeting","id":126564144,"image":"https://media.zenfs.com/en/ibd.com/c17b5b65818a93054b26ab66c9c27269","related":"NVDA","source":"Yahoo","summary":"Dow Jones Futures: Nvidia stock was in focus late Monday during CEO Jensen Huang's speech. Google and Tesla surged ahead of the Fed meeting.","url":"https://finnhub.io/api/news?id=95f75f632d64e11144b279d721b0fc75a05d4413965dfebecf821f9896b1ad2e"},{"category":"company","datetime":1710810000,"headline":"Nvidia's dizzying rally spurs rush into AI-themed ETFs","id":126566002,"image":"","related":"NVDA","source":"Finnhub","summary":"The fervor around artificialintelligence has sparked a gold rush into AI-themed ETFs, asinvestors seek fresh ways to play the burgeoning technologyfollowing breathtaking rallies in market darlings...","url":"https://finnhub.io/api/news?id=b96b63dc2e27896cdf9fa21d62be580e5ee8838041c05b79b2ffbb0f489ea65b"},{"category":"company","datetime":1710809616,"headline":"Nvidia's new software tools meant for companies adding AI to business","id":126565803,"image":"https://media.zenfs.com/en/reuters.com/9f58e057953d496339c3bf7037ad2279","related":"NVDA","source":"Yahoo","summary":"Nvidia on Monday unveiled software aimed at making it easier for businesses to incorporate artificial intelligence systems into their work, broadening the chipmaker's offerings.  The release highlights Nvidia's push to expand its presence in the AI application execution sector, called inference, where the company's chips don't dominate the market, said Joel Hellermark, CEO of Sana, a maker of AI assistants for companies.  Nvidia is best known for providing the chips used to train so-called foundation models like OpenAI's GPT-4.","url":"https://finnhub.io/api/news?id=9004072f372ff1f1987e9f6795cfa7f8f213b2a05685fdcc32b8d12b313f599d"},{"category":"company","datetime":1710807719,"headline":"Nvidia unveils robots powered by super computer and AI to take on world’s heavy industries","id":126565804,"image":"https://s.yimg.com/ny/api/res/1.2/sZa9YWZmTr.x8Li.GzVw2g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/fox_business_text_367/17fe813ce1b672aaaf256ccc442eea9a","related":"NVDA","source":"Yahoo","summary":"Nvidia announced plans for a software and hardware package consisting of generative artificial intelligence, to be used with robotics that can make better decisions over time.","url":"https://finnhub.io/api/news?id=d5849a1ed1de540ebd85442cbff1c085cda743742cfbb79ae5e7cf84b43835e2"},{"category":"company","datetime":1710806897,"headline":"Nvidia CEO Becomes Stock Kingmaker by Name-Dropping Dell, Ansys","id":126565805,"image":"https://s.yimg.com/ny/api/res/1.2/Y9.dJfQbVE7.wQGH5oxLtg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTk-/https://media.zenfs.com/en/bloomberg_markets_842/3b247ed5f9c32fe01998ead45bda0ff7","related":"NVDA","source":"Yahoo","summary":"(Bloomberg) -- Nvidia Corp. Chief Executive Officer Jensen Huang’s highly anticipated keynote failed to move the needle for his stock. But it turned out to be good for many of the company’s customers and partners.Most Read from BloombergApple Is in Talks to Let Google Gemini Power iPhone AI FeaturesMusk Says His Ketamine Prescription Is in Investors’ Best InterestsTrump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New TeamNvidia Unveils Successor to Its All-Conquering AI ProcessorPutin W","url":"https://finnhub.io/api/news?id=cb19937660b04f745cb1a7b3f1693da63384405c047090f40813b2f517194e4c"},{"category":"company","datetime":1710803892,"headline":"Nvidia launches NIM to make it smoother to deploy AI models into production","id":126565806,"image":"https://techcrunch.com/wp-content/uploads/2024/03/GTC-2024-TechCrunch-Haje-KampsIMG_7977.jpg?resize=1200,900","related":"NVDA","source":"Yahoo","summary":"At its GTC conference, Nvidia today announced Nvidia NIM, a new software platform designed to streamline the deployment of custom and pre-trained AI models into production environments. NIM takes the software work Nvidia has done around inferencing and optimizing models and makes it easily accessible by combining a given model with an optimized inferencing engine and then packing this into a container, making that accessible as a microservice. Typically, it would take developers weeks -- if not","url":"https://finnhub.io/api/news?id=b97bd2170e32c0f94f496d24dec38994ff2b168c192cb551047fd779e96aa60a"},{"category":"company","datetime":1710803520,"headline":"Nvidia Unveils Latest Chips at ‘AI Woodstock’","id":126565807,"image":"https://s.yimg.com/ny/api/res/1.2/0pDbTHo9PSxWO8pjpqO0UQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/3fcbc6cd64a88c65480dc9c812dddde6","related":"NVDA","source":"Yahoo","summary":"SAN JOSE, Calif.—The  Nvidia  frenzy over artificial intelligence has come to this: Chief Executive  Jensen Huang  unveiled his company’s latest chips on Monday in a sports arena at an event one analyst dubbed the “AI Woodstock.”  Customers, partners and fans of the chip company descended on the SAP Center, the home of the National Hockey League’s San Jose Sharks, for Huang’s keynote speech at an annual Nvidia conference that, this year, has a seating capacity of about 11,000.  At the center of the tech world’s attention is Huang, who has gone from a semiconductor CEO with a devoted following among videogame enthusiasts to an AI impresario with broad-enough appeal to draw thousands to a corporate event.","url":"https://finnhub.io/api/news?id=d72e913595ec9efc00f4b25d5512f132f5e9db09dfbbcbc73fd67ce19af13c90"},{"category":"company","datetime":1710801539,"headline":"Why SoundHound AI Stock Sank Today","id":126565808,"image":"https://g.foolcdn.com/editorial/images/769772/an-arrow-moving-down-above-chart-lines.jpg","related":"NVDA","source":"Yahoo","summary":"Even with a big pullback today, SoundHound stock is still up roughly 288% year to date.","url":"https://finnhub.io/api/news?id=5aab6978f641d9dfdb01d0200d0be037b0e2c676fa7d3261cf10a1e24468a7c4"},{"category":"company","datetime":1710800037,"headline":"SAP and Nvidia Announce Deal to 'Fine Tune' AI Models","id":126564218,"image":"https://s.yimg.com/ny/api/res/1.2/pTOPFPjrnku.63e1mK0Ydg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/20699984339928fb4454aaa2fe3e9598","related":"NVDA","source":"Yahoo","summary":"One of the most obvious things about artificial intelligence is that its power comes from access to vast troves of data.  CEO Christian Klein said in a recent interview that the company’s access to the most basic kinds of corporate financial, sales, and HR data makes it better positioned than rivals like Microsoft and Salesforce to revolutionize the way companies glean insights from their data.  “No other software company has access to as much business data as we have,” Klein told Barron’s. “The more data you have, the better it is...no matter if you do pricing with SAP, or order management, or logistics....We are not only relevant, we are reliable, because we have this access to a ton of business data.”","url":"https://finnhub.io/api/news?id=c384255dd9e54429b6cad4fd38db9323594d8b66423a9ae19f22a943fba25423"},{"category":"company","datetime":1710799745,"headline":"Nvidia Is Teaming Up with J\u0026J MedTech to Advance AI Surgery","id":126565810,"image":"https://s.yimg.com/ny/api/res/1.2/4xifJQbHgg5YDLjJM9x1Xg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/e9f00220f7e7f0a98f14eac8ea4583e9","related":"NVDA","source":"Yahoo","summary":"Nvidia said Monday that it was partnering with Johnson \u0026 Johnson MedTech to use the power of AI to help doctors perform surgery.  J\u0026J MedTech is in 80% of the world’s operating rooms and trains more than 140,000 healthcare professionals each year, the companies said.  The company believes Nvidia’s AI technology could improve data analytics from devices, patient, and other surgery data.","url":"https://finnhub.io/api/news?id=377b7e6a7ac89ec52b9d986a7c10f081c2a7616547fa4b22ed445baa5f282dec"},{"category":"company","datetime":1710799619,"headline":"Nvidia adds generative AI to power humanoid robots","id":126565811,"image":"https://media.zenfs.com/en/reuters.com/2da8cb6cea96cc9d13cf9b6348b2aa41","related":"NVDA","source":"Yahoo","summary":"Nvidia on Monday announced a hardware and software platform for building human-like robots that includes generative artificial intelligence features.  The new platform will consist of a computer system that will power the robot and AI, plus a package of software including genAI and other tools in order to build robots that are human-life, the company said at its annual developer conference.  The addition of genAI will let the humanoid robots take actions based on inputs with a combination of language, video, \"human demonstrations,\" and past experiences.","url":"https://finnhub.io/api/news?id=9975735279edca0453efba05785c359dcf91881f3dcbac720a3c31474cd23533"},{"category":"company","datetime":1710799584,"headline":"Nvidia Unveils Successor to Its All-Conquering AI Processor","id":126564145,"image":"https://s.yimg.com/ny/api/res/1.2/tFCmK8SCgQO_Kzgf2finug--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MDQ-/https://media.zenfs.com/en/bloomberg_technology_68/1d1e123d90eab5fb6ad8d27144c0493f","related":"NVDA","source":"Yahoo","summary":"(Bloomberg) -- Nvidia Corp. Chief Executive Officer Jensen Huang showed off new chips aimed at extending his company’s dominance of artificial intelligence computing, a position that’s already made it the world’s third-most-valuable business. Most Read from BloombergApple Is in Talks to Let Google Gemini Power iPhone AI FeaturesMusk Says His Ketamine Prescription Is in Investors’ Best InterestsPutin Warns Russia Won’t Stop After Predictable Election WinNvidia Unveils Successor to Its All-Conquer","url":"https://finnhub.io/api/news?id=4a071911ff1f0c77b4e344061a676ad1a4c2946c5dde0a254020b1b7efc29f4a"},{"category":"company","datetime":1710799578,"headline":"Nvidia Seeks To Advance 6G Wireless Through AI","id":126565813,"image":"https://s.yimg.com/ny/api/res/1.2/Yyhv.ieibxXco42p9Ky2LA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/f95767f196f3dded08166ec89414fe27","related":"NVDA","source":"Yahoo","summary":"Nvidia announced a 6G research platform that it hopes will help companies innovate more rapidly around wireless technologies. Using Nvidia’s platform, companies will be able to run accurate simulations of physical terrain and man-made buildings to improve wireless transmission reliability.","url":"https://finnhub.io/api/news?id=5d9f951d9ea59ee15578fce01479ff10c15e9fcc82fc58d18dff2dbd4f736042"},{"category":"company","datetime":1710799529,"headline":"Nvidia expands ties with Chinese EV makers as auto AI race heats up","id":126565814,"image":"https://media.zenfs.com/en/reuters-finance.com/7e80cb8e9cee5a46fe3166ef141af576","related":"NVDA","source":"Yahoo","summary":"Nvidia said on Monday it is expanding its collaborations with BYD and other Chinese automakers that are racing to build self-driving vehicles and AI-augmented infotainment technology to compete in global markets.  BYD, which overtook Tesla last year as the world's No. 1 electric vehicle manufacturer, will use Nvidia's next generation of in-vehicle chips, called Drive Thor, to enable increased levels of autonomous driving and other digital functions, Nvidia said.  BYD will also use Nvidia technology to streamline factories and its supply chain, as well as to develop virtual showrooms, Nvidia Vice President for Automotive Danny Shapiro said during a conference call.","url":"https://finnhub.io/api/news?id=35afb7d27860aef488e0908a876b72e793b2196ae1e744a4975b86d6de09a844"},{"category":"company","datetime":1710799398,"headline":"Synopsys Stock Rises on Nvidia Announcements","id":126564449,"image":"https://media.zenfs.com/en/Barrons.com/12ea0f43d8f8307249a68d1cb2e0587e","related":"NVDA","source":"Yahoo","summary":"Synopsys shares perked up in late trading Monday after the electronic design automation company got a shout-out from the stage at the Nvidia GTC event on Monday in San Jose.  Mentions by Nvidia CEO Jensen Huang at the event also gave a boost to other electronic design companies, in particular Ansys, which recently accepted a takeover bid from Synopsys, and Cadence Design Systems.  Huang made the point that GPU chips and artificial intelligence together are accelerating chip and electronics design processes.","url":"https://finnhub.io/api/news?id=ba2bc3ec4229a8845be4dc8f6c50886763d6178b4fa0079071e7e687342ae6d7"},{"category":"company","datetime":1710799384,"headline":"Schneider Electric and Nvidia Want to Standardize Data-Center Designs","id":126564759,"image":"https://media.zenfs.com/en/Barrons.com/12ea0f43d8f8307249a68d1cb2e0587e","related":"NVDA","source":"Yahoo","summary":"The artificial intelligence [boom](https://www.barrons.com/articles/nvidia-stock-ai-enterprise-ac27b3fa) being powered by Nvidia chips looks like it is “for real.”  Monday, the Paris-based electrical-hardware company Schneider Electric unveiled a collaboration designed to do just that.  Schneider and Nvidia are working to industrialize the data-center business.","url":"https://finnhub.io/api/news?id=b532f1f7a329ab4b508fbcf13f3aebcd6e1ede5b549881f5ccea254200ad6c93"},{"category":"company","datetime":1710799367,"headline":"Nvidia launches cloud-based research platform for 6G research and testing","id":126565817,"image":"https://media.zenfs.com/en/reuters.com/73098ba49fdfb83f9a8aff1b96288374","related":"NVDA","source":"Yahoo","summary":"The new technology for communications known as 6G - the successor to 5G - is expected to launch commercially around 2030.  Software and AI are increasingly deployed across the telecom sector, including in RAN (radio access network) hardware like base stations and antennas.  Nvidia's platform will include an app that simulates environments such as single cell towers or entire cities, allowing researchers and organisations to test 6G networks in real time.","url":"https://finnhub.io/api/news?id=b70168b869fa599de09c3bf4a810aabf5a99fc70f46b191c5025a567fc62e165"},{"category":"company","datetime":1710799260,"headline":"NVIDIA Digital Human Technologies Bring AI Characters to Life","id":126565818,"image":"https://s.yimg.com/ny/api/res/1.2/WGKll_stVy2DGV4XqlhKxg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/globenewswire.com/67431d17fdb8e8ca3aa33a2972040a65","related":"NVDA","source":"Yahoo","summary":"Leading AI Developers Use Suite of NVIDIA Technologies to Create Lifelike Avatars and Dynamic Characters for Everything From Games to Healthcare, Financial Services and Retail Applications NVIDIA Digital Human Technologies Bring AI Characters to Life Covert Protocol, a new technology demonstration created by Inworld AI in partnership with NVIDIA, shows how character interactions in games can be brought to life using NVIDIA digital human technologies. SAN JOSE, Calif., March 18, 2024 (GLOBE NEWSW","url":"https://finnhub.io/api/news?id=3b90158248c0260ff21f461241b55e0b245b42d5f8094795194d7ae9a21c03ff"},{"category":"company","datetime":1710792394,"headline":"Tracking Philippe Laffont's Coatue Management Portfolio - Q4 2023 Update","id":126563591,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/472298390/image_472298390.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"Coatue Management's 13F portfolio value increased from $19.71B to $23.84B in the last quarter. Check out the article for more details.","url":"https://finnhub.io/api/news?id=76e5de505258cb068956a924bcad7a78e8985fbd60c0d0872611eb0ba6a5e18b"},{"category":"company","datetime":1710785945,"headline":"NVIDIA : Unveils Digital Blueprint for Building Next-Gen Data Centers","id":126561901,"image":"","related":"NVDA","source":"Finnhub","summary":"Designing, simulating and bringing up modern data centers is incredibly complex, involving multiple considerations like performance, energy efficiency and scalability. ...","url":"https://finnhub.io/api/news?id=06c7b85286107c79f5da4184fc07b9043370f33d453da0a6ee42dc2cb9663987"},{"category":"company","datetime":1710785942,"headline":"NVIDIA : Maxine Developer Platform to Transform $10 Billion Video Conferencing Industry","id":126561903,"image":"","related":"NVDA","source":"Finnhub","summary":"has allowed many to be productive from anywhere. Now NVIDIA is boosting the productivity of the developers of video conferencing, call...","url":"https://finnhub.io/api/news?id=a30e70ebd09cc30dc8d7b7f084713b298f9caeef05e66b93ad50ffa03012cc0c"},{"category":"company","datetime":1710784879,"headline":"Google Cloud and NVIDIA Expand Partnership to Scale AI Development","id":126561595,"image":"","related":"NVDA","source":"Finnhub","summary":"New AI infrastructure offerings and integrations enable more open and accessible AISAN JOSE, Calif., March 18, 2024 /PRNewswire/ -- GTC -- Google Cloud and NVIDIA today announced a deepened...","url":"https://finnhub.io/api/news?id=fb66e8cf524ebe36b001e3565ce95d37478c81ad2a76ecd90b81176d28f5ea85"},{"category":"company","datetime":1710784877,"headline":"Oracle and NVIDIA to Deliver Sovereign AI Worldwide","id":126561596,"image":"","related":"NVDA","source":"Finnhub","summary":"Oracle and NVIDIA collaborate to deliver accelerated computing and generative AI services that establish digital sovereignty and manage proprietary national and personal dataOracle adopts NVIDIA...","url":"https://finnhub.io/api/news?id=89fe202d54e8ccc668eb476f86a4f677096fdc2e0caa9f6307c148a82642d3d6"},{"category":"company","datetime":1710784874,"headline":"SAP and NVIDIA to Accelerate Generative AI Adoption Across Enterprise Applications Powering Global Industries","id":126561602,"image":"","related":"NVDA","source":"Finnhub","summary":"Customers Can Harness Their Business Data in Cloud Solutions from SAP Using Customized LLMs Deployed with NVIDIA AI Foundry Services and New NVIDIA NIM MicroservicesWALLDORF, Germany and SANTA...","url":"https://finnhub.io/api/news?id=d5a9a6f01792b7ebab6ceffbf721f6889bd4f58226f1a16efd2d20168423aa71"},{"category":"company","datetime":1710784869,"headline":"NVIDIA Unveils 6G Research Cloud Platform to Advance Wireless Communications With AI","id":126561603,"image":"","related":"NVDA","source":"Finnhub","summary":"SAN JOSE, Calif., March 18, 2024 -- GTC -- NVIDIA today announced a 6G research platform that empowers researchers with a novel approach to develop the next phase of wireless technology. The...","url":"https://finnhub.io/api/news?id=9e4f002adbe0baa3660b26a9fbf0398ace8e86e2ad907c524760faf76405754e"},{"category":"company","datetime":1710784868,"headline":"NVIDIA Powers Japan’s ABCI-Q Supercomputer for Quantum Research","id":126561604,"image":"","related":"NVDA","source":"Finnhub","summary":"SAN JOSE, Calif., March 18, 2024 -- GTC—NVIDIA today announced that Japan’s new ABCI-Q supercomputer — designed to advance the nation’s quantum computing initiative — will be powered by...","url":"https://finnhub.io/api/news?id=6b709334a0077d591f4ad574e2a9ae7b61588e0060ffcb521214509eb2b907c4"},{"category":"company","datetime":1710784745,"headline":"NVIDIA Launches Cloud Quantum-Computer Simulation Microservices","id":126561563,"image":"","related":"NVDA","source":"Finnhub","summary":"SAN JOSE, Calif., March 18, 2024 -- GTC -- NVIDIA today launched a cloud service that allows researchers and developers to push the boundaries of quantum computing exploration in key scientific...","url":"https://finnhub.io/api/news?id=b50738e3fdcfad864c02f251f2c42659b1cee10bc2549483459ce9a5108084cd"},{"category":"company","datetime":1710784644,"headline":"Tech Up on AI Momentum -- Tech Roundup","id":126561553,"image":"","related":"NVDA","source":"Finnhub","summary":"Shares of technology companies rose as traders chased gains in artificial-intelligence issues. Excitement built ahead of Nvidia Chief Executive Jensen Huang's unveiling of new chips. Investors...","url":"https://finnhub.io/api/news?id=154a549a451cb4af6efa738c7f32ad26d8522d8f77eaf01e4691ad03741baddc"},{"category":"company","datetime":1710784504,"headline":"NVIDIA Announces Project GR00T Foundation Model for Humanoid Robots and Major Isaac Robotics Platform Update","id":126561505,"image":"","related":"NVDA","source":"Finnhub","summary":"SAN JOSE, Calif., March 18, 2024 -- GTC -- NVIDIA today announced Project GR00T, a general-purpose foundation model for humanoid robots, designed to further its work driving breakthroughs in...","url":"https://finnhub.io/api/news?id=261e21aa11ddb051ed8d99979ef8519bed44e00d9a8b65ed695c2964cc08080e"},{"category":"company","datetime":1710784084,"headline":"NVIDIA DRIVE Powers Next Generation of Transportation — From Cars and Trucks to Robotaxis and Autonomous Delivery Vehicles","id":126561368,"image":"","related":"NVDA","source":"Finnhub","summary":"SAN JOSE, Calif., March 18, 2024 -- —GTC—NVIDIA today announced that leading companies across the transportation sector have adopted the NVIDIA DRIVE Thor™ centralized car computer to power...","url":"https://finnhub.io/api/news?id=407a40888af9f6107343e55182b3f56cf79c81d9835d9a2b0e3beb6f47d013e1"},{"category":"company","datetime":1710783544,"headline":"NVIDIA Announces Omniverse Cloud APIs to Power Wave of Industrial Digital Twin Software Tools","id":126561292,"image":"","related":"NVDA","source":"Finnhub","summary":"SAN JOSE, Calif., March 18, 2024 -- NVIDIA today announced that NVIDIA Omniverse™ Cloud will be available as APIs, extending the reach of the world’s leading platform for creating industrial...","url":"https://finnhub.io/api/news?id=0cc6a10134a3d43f73831746cccafb17be0a1a046c85fd41a1f7e7545b70c806"},{"category":"company","datetime":1710782344,"headline":"NVIDIA Launches Generative AI Microservices for Developers to Create and Deploy Generative AI Copilots Across NVIDIA CUDA GPU Installed Base","id":126560977,"image":"","related":"NVDA","source":"Finnhub","summary":"New Catalog of GPU-Accelerated NVIDIA NIM Microservices and Cloud Endpoints for Pretrained AI Models Optimized to Run on Hundreds of Millions of CUDA-Enabled GPUs Across Clouds, Data Centers,...","url":"https://finnhub.io/api/news?id=d9e94c2309803300c9b92ebc7a23471ab1964bd1fe456451e2c72b8af9b103f6"},{"category":"company","datetime":1710782226,"headline":"NVIDIA Healthcare Launches Generative AI Microservices to Advance Drug Discovery, MedTech and Digital Health","id":126560944,"image":"","related":"NVDA","source":"Finnhub","summary":"SAN JOSE, Calif.—GTC, March 18, 2024 -- NVIDIA today launched more than two dozen new microservices that allow healthcare enterprises worldwide to take advantage of the latest advances in...","url":"https://finnhub.io/api/news?id=54c88ffde147ad7fd8d60004d63667fced69bb7540876725affbd2003933edc2"},{"category":"company","datetime":1710782107,"headline":"Microsoft and NVIDIA announce major integrations to accelerate generative AI for enterprises everywhere","id":126560919,"image":"","related":"NVDA","source":"Finnhub","summary":"Microsoft Azure to adopt NVIDIA Grace Blackwell Superchip to accelerate customer and first-party AI offeringsNVIDIA DGX Cloud's native Integration with Microsoft Fabric to streamline custom AI...","url":"https://finnhub.io/api/news?id=19b0dd1543de3e731354bdf6ab10a6feac0b3219ac925abc407c71339b5405c0"},{"category":"company","datetime":1710781923,"headline":"NVIDIA Announces Earth Climate Digital Twin","id":126560856,"image":"","related":"NVDA","source":"Finnhub","summary":"SAN JOSE, Calif., March 18, 2024 -- GTC -- To accelerate efforts to combat the $140 billion in economic losses due to extreme weather brought on by climate change, NVIDIA today announced its...","url":"https://finnhub.io/api/news?id=4a88d809e99d76e7c8dfafa967847aa55a213fa56974c85df9bb7049d6d2dbce"},{"category":"company","datetime":1710781500,"headline":"AWS and NVIDIA Extend Collaboration to Advance Generative AI Innovation","id":126563519,"image":"","related":"NVDA","source":"Business Wire","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=d56741d9d6f4c4508668dce9e20fa4171f16387f5a9e4cbb88639ee629559f82"},{"category":"company","datetime":1710781142,"headline":"NVIDIA : AWS and NVIDIA Extend Collaboration to Advance Generative AI Innovation","id":126560639,"image":"","related":"NVDA","source":"Finnhub","summary":"AWS to offer NVIDIA Grace Blackwell GPU-based Amazon EC2 instances and NVIDIA DGX Cloud to accelerate performance of building and running inference on...","url":"https://finnhub.io/api/news?id=dee188d1d72d302688c7a77faa4dfe1b62988a0a81ef9f0dec1d86b69aa776da"},{"category":"company","datetime":1710780840,"headline":"Nvidia CEO Huang Announces higher performing chip amid AI boom","id":126563732,"image":"","related":"NVDA","source":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=651bbdeef8697edd95ad2fb0608e0de7345a33d9e2a0b634fcc75f163e067cfe"},{"category":"company","datetime":1710779467,"headline":"NVIDIA Announces New Switches Optimized for Trillion-Parameter GPU Computing and AI Infrastructure","id":126560187,"image":"","related":"NVDA","source":"Finnhub","summary":"NVIDIA Quantum-X800 InfiniBand for Highest-Performance AI-Dedicated InfrastructureNVIDIA Spectrum-X800 Ethernet for AI-Optimized Networking in Every Data CenterNVIDIA Software Distributes Computing...","url":"https://finnhub.io/api/news?id=753f1874e4bcbb9a70e7dc302ef0ec5504f7095056dc18b55975b8fadf31cc47"},{"category":"company","datetime":1710779467,"headline":"NVIDIA Launches Blackwell-Powered DGX SuperPOD for Generative AI Supercomputing at Trillion-Parameter Scale","id":126560186,"image":"","related":"NVDA","source":"Finnhub","summary":"Scales to Tens of Thousands of Grace Blackwell Superchips Using Most Advanced NVIDIA Networking, NVIDIA Full-Stack AI Software, and StorageFeatures up to 576 Blackwell GPUs Connected as One With...","url":"https://finnhub.io/api/news?id=891df9e7bf5e3403b989015bdd3d0a43fbd4df2656f1fad009b88799815689ff"},{"category":"company","datetime":1710779287,"headline":"NVIDIA Blackwell Platform Arrives to Power a New Era of Computing","id":126560110,"image":"","related":"NVDA","source":"Finnhub","summary":"New Blackwell GPU, NVLink and Resilience Technologies Enable Trillion-Parameter-Scale AI ModelsNew Tensor Cores and TensorRT- LLM Compiler Reduce LLM Inference Operating Cost and Energy by up to...","url":"https://finnhub.io/api/news?id=6ebd492d0a56ca3225d23b4dbffb696e5e2f3933fd9b441a0261a84f79bed747"},{"category":"company","datetime":1710779044,"headline":"Why Nvidia Stock Popped on Monday Morning","id":126556993,"image":"https://g.foolcdn.com/editorial/images/769697/the-letters-ai-superimposed-over-a-circuit-board.jpg","related":"NVDA","source":"Yahoo","summary":"The artificial intelligence (AI) specialist got a double dose of love from Wall Street.","url":"https://finnhub.io/api/news?id=165572da7a6b0da53f84bdbca9549097b99db6c09118bcb141b5bc91425fefa7"},{"category":"company","datetime":1710773425,"headline":"Dow Jones Climbs As Nvidia AI Event Kicks Off; Cathie Wood Snaps Up Stock Amid 51% Plunge","id":126554642,"image":"https://media.zenfs.com/en/ibd.com/aada89f2da78ebaa097faf5501aeea56","related":"NVDA","source":"Yahoo","summary":"The Dow Jones gained. An Nvidia AI event started amid reports of a tie-up between Apple and Alphabet. Cathie Wood bought a diving stock.","url":"https://finnhub.io/api/news?id=26eed4d6fb2df84a4cfebda91ba4f1037fa9ff6dd7c4a1e9cc987f4cd41b4168"},{"category":"company","datetime":1710778804,"headline":"TSMC and Synopsys Bring Breakthrough NVIDIA Computational Lithography Platform to Production","id":126559963,"image":"","related":"NVDA","source":"Finnhub","summary":"SAN JOSE, Calif., March 18, 2024 -- GTC -- NVIDIA today announced that TSMC and Synopsys are going into production with NVIDIA’s computational lithography platform to accelerate manufacturing...","url":"https://finnhub.io/api/news?id=752d20dbe522a86b7076628fbed2942ca87c5cf980369d66df830606a88cadcf"},{"category":"company","datetime":1710778620,"headline":"Forget the \"Magnificent Seven\": This ETF Is a Better Choice for the Artificial Intelligence (AI) Era","id":126556995,"image":"https://g.foolcdn.com/editorial/images/769523/artificial-intelligence-robotics-ai-touchscreen.jpg","related":"NVDA","source":"Yahoo","summary":"The \"Magnificent Seven\" wowed investors last year, but the elite group of stocks looks more pedestrian this year.","url":"https://finnhub.io/api/news?id=e38e74bea26c15fc0ca456527ef803905761c22c82c00bef8ae90ee02b25e20e"},{"category":"company","datetime":1710778560,"headline":"NEW YORK MARKET CLOSE: Alphabet in favour as stocks rise ahead of FOMC","id":126561173,"image":"","related":"NVDA","source":"Alliance News","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=5940b0b4884f601fefd4228bbcfa710b5244d55944808b3f85b1251b9f2a03cb"},{"category":"company","datetime":1710778500,"headline":"Better AI Stock: Arm Holdings vs. Advanced Micro Devices (AMD)","id":126556996,"image":"https://g.foolcdn.com/editorial/images/769529/digital-illustration-of-a-semiconductor.jpg","related":"NVDA","source":"Yahoo","summary":"Which of these popular chipmakers is a better buy right now?","url":"https://finnhub.io/api/news?id=21ebffe52ced4186c74293287d355080cafe45ef4072e46ac6d17aa625244da1"},{"category":"company","datetime":1710772620,"headline":"These Stocks Are Moving the Most Today: Nvidia, Super Micro Computer, Alphabet, Nuvei, HashiCorp, Tesla, PepsiCo, and More","id":126554699,"image":"https://s.yimg.com/ny/api/res/1.2/pvXi5_g6NFz7OEUHojMNhQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/Barrons.com/fe58657c7160052ad0a83354e44e2ebe","related":"NVDA","source":"Yahoo","summary":"Nvidia’s annual GTC conference begins Monday, Super Micro Computer joins the S\u0026P 500 index, and Tesla is raising prices for its Model Y vehicles.","url":"https://finnhub.io/api/news?id=7d9b4e7eedfcbbe8bf27ecdf2aa74518d23f459e356941af1062b2308f4f5de4"},{"category":"company","datetime":1710772445,"headline":"Stocks to Watch Monday: Alphabet, Apple, Nvidia, Supermicro","id":126554643,"image":"https://s.yimg.com/ny/api/res/1.2/r77WgMm76na80OZ1wygATQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/bbe8620794523a0638723eb628397be9","related":"NVDA","source":"Yahoo","summary":"↗️ [**HashiCorp (HCP)**](https://www.wsj.com/market-data/quotes/HCP): Shares jumped about 9% in early trading after Bloomberg reported that the cloud-software provider was weighing a sale. ↗️ [**Alphabet (GOOGL)**](https://www.","url":"https://finnhub.io/api/news?id=94a6863b5e6df57b87d7e61c5e819316485ce97330df9e560e406caeb03398ab"},{"category":"company","datetime":1710777646,"headline":"US STOCKS-Megacaps' rally lifts tech-heavy Nasdaq","id":126556857,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","related":"NVDA","source":"Yahoo","summary":"Wall Street's main indexes rose on Monday, with a rally in megacap growth stocks such as Alphabet and Tesla supporting a sharp recovery in the tech-laden Nasdaq ahead of the U.S. Federal Reserve's meeting this week.  Most market-leading growth stocks rallied, with Alphabet gaining 6.7% after a media report that Apple is in talks to build Google's Gemini AI engine into the iPhone.  Focus will also be on AI-darling Nvidia, which kicks off its annual developer conference, with investors focused on new chip announcements from Chief Executive Jensen Huang in an afternoon keynote address.","url":"https://finnhub.io/api/news?id=fad2600c7ff9a0ea9e8cdc410b73e94b4026affeef033497f11b4bb8e5ac6313"},{"category":"company","datetime":1710777102,"headline":"Federal Reserve, Bank of Japan, Nvidia: What to Watch This Week","id":126556880,"image":"https://s.yimg.com/ny/api/res/1.2/AvhOMsyIbykRtr_MMjCqUg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/24f318124cb1a8880d8a909b4aa95399","related":"NVDA","source":"Yahoo","summary":"Central banks around the world are holding policy meetings this week and there are also some major earnings on the slate. Here are some economic and corporate highlights to look out for: + **Monday**: Nvidia's flagship conference for developers [kicks off](https://www.","url":"https://finnhub.io/api/news?id=770740ebb617b82f72fd0da8b08fc29ba006eff316d09e79e8b482dd3a2b2ec4"},{"category":"company","datetime":1710775942,"headline":"Why Taiwan Semiconductor Stock Was Moving Higher Today","id":126554910,"image":"https://g.foolcdn.com/editorial/images/769680/tweezers-with-computer-chip.jpg","related":"NVDA","source":"Yahoo","summary":"AI stocks were rising again today.","url":"https://finnhub.io/api/news?id=27b9e960a5da7ebad2887cf26c15fd2cee11dfd3af740317bd0413f439fafeb9"},{"category":"company","datetime":1710775800,"headline":"2 Stocks That Will Surge on the Next Wave of AI","id":126555621,"image":"https://g.foolcdn.com/editorial/images/769512/artificial-intelligence-ai-robot-big-data-bull-market-stock-chart-getty.jpg","related":"NVDA","source":"Yahoo","summary":"It's still early innings in artificial intelligence.","url":"https://finnhub.io/api/news?id=a837a434dfbe27c2023942afae581681a6c9a26d8e16bd968df35dd393c2f76c"},{"category":"company","datetime":1710774900,"headline":"Nvidia Set to Unveil Its Latest Chips at ‘AI Woodstock’","id":126557003,"image":"https://s.yimg.com/ny/api/res/1.2/3c7.6dy66.ntzpghtFD63Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/wsj.com/c9d84fc446164ea4ae513826c61c2d72","related":"NVDA","source":"Yahoo","summary":"SAN JOSE, Calif.—The  Nvidia  frenzy over artificial intelligence has come to this: Chief Executive  Jensen Huang  is expected to unveil his company’s latest chips on Monday in a sports arena at an event one analyst dubbed the “AI Woodstock.”  Customers, partners and fans of the chip company are descending on the SAP Center, the home of the National Hockey League’s San Jose Sharks, for Huang’s keynote speech at an annual Nvidia conference that, this year, has a seating capacity of about 11,000.  At the center of the tech world’s attention is Huang, who has gone from a semiconductor CEO with a devoted following among videogame enthusiasts to an AI impresario with broad-enough appeal to draw thousands to a corporate event.","url":"https://finnhub.io/api/news?id=4dc4f107f12b4a53a2fd98a147f726b006619aded76a2f0fdce124ca737e6036"},{"category":"company","datetime":1710774743,"headline":"Nvidia AI developer conference kicks off with new chips in focus","id":126558784,"image":"","related":"NVDA","source":"Finnhub","summary":"Artificialintelligence semiconductor powerhouse Nvidia kicked offits annual developer conference on Monday, with investorsfocused on new chip announcements from Chief Executive JensenHuang in an...","url":"https://finnhub.io/api/news?id=64485c235b3498ce620b6295c00123be3d98f196a78f4ed7adc5cce9e833fae7"},{"category":"company","datetime":1710774399,"headline":"Nvidia Stock Pops Ahead of CEO Address at Flagship Conference","id":126557004,"image":"https://media.zenfs.com/en/wsj.com/7b2c285183be07ca3c4e8242b25a59a8","related":"NVDA","source":"Yahoo","summary":"Nvidia shares rose Monday as investors awaited an appearance by Chief Executive Jensen Huang at the chip maker's [annual developers conference](https://www.wsj.com/tech/ai/nvidia-annual-conference-chips-7692760d) this afternoon.","url":"https://finnhub.io/api/news?id=ed517e7b5f48dfb7f02a28d8841c38fdb588a2e0ff953787e469979ede01c9df"},{"category":"company","datetime":1710774000,"headline":"3 \"Magnificent Seven\" Stocks to Buy Now","id":126554641,"image":"https://g.foolcdn.com/editorial/images/767369/cloud_computing_technicians_install-fix_gpu-servers-gettyimages-1148233830.jpg","related":"NVDA","source":"Yahoo","summary":"This trio of industry-leading companies possess compelling reasons to invest.","url":"https://finnhub.io/api/news?id=41b18965e868222cf22434f1e9564b97529ba09874994b017adea0a0c3da1211"},{"category":"company","datetime":1710773728,"headline":"Celestica: AI Wave Caution","id":126558498,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1296009212/image_1296009212.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"Celestica Inc.'s impressive 300% gain in the past year may not continue, as they heavily rely on one customer. Learn more about CLS stock prospects here.","url":"https://finnhub.io/api/news?id=87777814382441b0c4cbcd99939831c33c9723ffcad231de1321d68480c74d29"},{"category":"company","datetime":1710772162,"headline":"Nvidia Rises On Bullish Analyst Views, AI Event;  Is Nvidia A Buy?","id":126557006,"image":"https://media.zenfs.com/en/ibd.com/7d90d093412fc98e44c22e81f0541cdc","related":"NVDA","source":"Yahoo","summary":"Nvidia gained 240% in 2023. Analysts have a price target of 700 for the stock. Is Nvidia stock a buy now?","url":"https://finnhub.io/api/news?id=0ff01cede2de232c50963ec0cdbf998419adc55bdbbe9d419da77934bf28fda0"},{"category":"company","datetime":1710772063,"headline":"Should You Hold Nvidia (NVDA)?","id":126557007,"image":"https://media.zenfs.com/en/insidermonkey.com/943322b567353791f7a79eefa0ce1ce0","related":"NVDA","source":"Yahoo","summary":"Orbis Investment Management, an investment management company, released its “Orbis Global Equity Strategy” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. The strategy returned 20.8% on a weighted-net basis (1) an attractive absolute return, but underperformed the MSCI World Index, which rose 23.8%. In addition, please check the fund’s […]","url":"https://finnhub.io/api/news?id=b605fb253d563550389a6e9d6460dc26f58ad7614f33f4217340a357a3fc6177"},{"category":"company","datetime":1710770584,"headline":"Dow Jones Rises As Nvidia Rallies Ahead Of AI Event; Google Stock Surges On Gemini Talks","id":126554421,"image":"https://media.zenfs.com/en/ibd.com/8e3f0f90c622d76c522be98b9f3975ee","related":"NVDA","source":"Yahoo","summary":"Stock Market Today: The Dow Jones rose Monday, as Nvidia rallied ahead of its AI event. Google stock surged on Gemini talks.","url":"https://finnhub.io/api/news?id=813ed6b0a65a140cdcca39e32951b1cc9cc1896a15aecc86d0d929026cf8bc64"},{"category":"company","datetime":1710770400,"headline":"Could Arm Holdings Become the Next Nvidia?","id":126557009,"image":"https://g.foolcdn.com/editorial/images/769527/semiconductor-board.jpg","related":"NVDA","source":"Yahoo","summary":"This chip designer is impressing the bulls again with its accelerating growth.","url":"https://finnhub.io/api/news?id=17c2b2f43292b56fbccf704742f7415e0d5011bbe36f842ba44f5510ac670bcb"},{"category":"company","datetime":1710770030,"headline":"US STOCKS-Nasdaq leads Wall St higher ahead of Fed meeting; Nvidia kicks off AI conference","id":126554422,"image":"https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo-1200x1200.png","related":"NVDA","source":"Yahoo","summary":"The tech-heavy Nasdaq led gains amongst Wall Street peers on Monday ahead of the U.S. Federal Reserve's meeting this week, where the central bank is expected to keep borrowing costs steady and provide cues on its monetary policy trajectory.  Most megacap growth stocks advanced, with Alphabet gaining 6.4% after a media report that Apple is in talks to build Google's Gemini AI engine into the iPhone.","url":"https://finnhub.io/api/news?id=5d4dbae987b32f4fd67edfbef738e2794def2e7394bac11f68db618855975922"},{"category":"company","datetime":1710769712,"headline":"Nvidia Price Targets Upgraded Ahead of GTC Event. The Stock Is Climbing.","id":126557011,"image":"https://media.zenfs.com/en/Barrons.com/12ea0f43d8f8307249a68d1cb2e0587e","related":"NVDA","source":"Yahoo","summary":"Nvidia stock was rising on Monday as the market anticipated a positive reaction to its GTC developers’ event.  Wall Street analysts are also weighing in with price-target upgrades.  Nvidia shares were up 4.8% in early trading at $920.84.","url":"https://finnhub.io/api/news?id=3aed300c14a3ae081aec0a08973c33e6793738a006fe7ae75b8a9a8bd5dc124e"},{"category":"company","datetime":1710766740,"headline":"Micron Technology Poised for Growth On Strong AI Demand As Industry Enters The Most Significant Memory Cycle: Analyst","id":126558316,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=b1a9d49e058cf4ec36598ee4e58c64062b8bd0286731ecbef03378f1cbe877ec"},{"category":"company","datetime":1710766320,"headline":"‘Keep on Buying,’ Says Top Analyst William Stein About Nvidia AI Stock","id":126563740,"image":"","related":"NVDA","source":"TipRanks","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=2864a746ef3965539048e0f1deaa2eee20ae43e768053799348667d8990045b3"},{"category":"company","datetime":1710766260,"headline":"This Week: NVDA CEO Huang Keynote AI Speech, BOJ And Fed Decisions","id":126560129,"image":"","related":"NVDA","source":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=ec315c020f3a4686017173a474e22d6c08614bbf3d3b83c3d0af01299b337e8a"},{"category":"company","datetime":1710766140,"headline":"AI PCs set to grow share in global PC shipments, starting major market transition","id":126557222,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=c1b715e2081cc8a8c282e27d5e34c6a06bd78d582af1c12a0f5dac02b5111759"},{"category":"company","datetime":1710766020,"headline":"3 ETFs to Avoid as the S\u0026P 500 Hit an All-Time Highs","id":126557881,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=acd7ced93f1c1c7b9174e1d756249a3559e30693a2633d6e801ecbb894bfedf5"},{"category":"company","datetime":1710765420,"headline":"Beyond the Biggies: 3 Alternative Chip Stocks Gaining Traction","id":126558547,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=515bd601b81efb9e658e946471c2003065fe5663fdee126629374addb77b5764"},{"category":"company","datetime":1710765360,"headline":"10 Information Technology Stocks Whale Activity In Today's Session","id":126557248,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=b0e324443067efc18ccefde2d64a9964441c10df3d1ff0543c1e44d3a97a1660"},{"category":"company","datetime":1710765180,"headline":"FXL: Technology Sector Dashboard For March","id":126555695,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=6626cc2be14a75bc593711bed77004a1d449fdb36b909b85f93f3dd5a4e241a7"},{"category":"company","datetime":1710765000,"headline":"AI Stocks Rally Ahead Of Nvidia's 'Woodstock': Analysts Eye Next Phases For Growth","id":126558319,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=503142ecdc8e53c6016b378a294499ac5ca6979be0683fe8cad39185ce18e8df"},{"category":"company","datetime":1710763851,"headline":"A Trillion Dollars Created Every 100 Days Weighs Down Markets","id":126555362,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1522860540/image_1522860540.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"Highly prolonged periods of inflation can be expected with U.S. debt reaching $34 trillion. Read my article to know more details.","url":"https://finnhub.io/api/news?id=cfbadbb15e05a901097b293e20703fbba71f84671ffd7e4cc82323d4f1d50a7a"},{"category":"company","datetime":1710763200,"headline":"Nvidia's Groundbreaking AI Innovations at GTC 2024 Spark Analyst Enthusiasm","id":126558166,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=1eb138fa80eb0b16b1a7f59cedccde9d1f7528d211c72cdc496ebca75220e959"},{"category":"company","datetime":1710761640,"headline":"Nvidia's GTC 2024: Semiconductor Stock Rides The AI Wave","id":126556091,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=7129a478c06ce7b311b5b753eefe532dd72c874156e7d0c2dd21bd79e07b5225"},{"category":"company","datetime":1710761376,"headline":"Nvidia: keynote expected with new AI platform","id":126554693,"image":"","related":"NVDA","source":"Finnhub","summary":"After stalling last week, Nvidia's share price is back on the rise in early trading on the New York Stock Exchange on Monday, in anticipation of the keynote to be delivered later today by Jensen...","url":"https://finnhub.io/api/news?id=a12d35519f8f1b595c7d92266dab3e76cfa3fdbfdf2108c8ebb25e49f684316c"},{"category":"company","datetime":1710761369,"headline":"Nvidia: Nobody Rings A Bell At The Top","id":126554785,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1988504231/image_1988504231.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"Nvidia Corporation's strong quarterly results are impressive, but concerns linger over stock market exuberance over the stock price. Click for my NVDA update.","url":"https://finnhub.io/api/news?id=be7059ef3dde5b815d653d026c3c16ce5b3829069e40b617ca15312a475d6b71"},{"category":"company","datetime":1710759600,"headline":"Nvidia CEO Jensen Huang Speech May Determine Course Of AI Rally – Huang More Important Than Powell","id":126555187,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=96d596eb229e1f4fded4c045a1235066592a9170c593e47181557bb5f2fffef2"},{"category":"company","datetime":1710759000,"headline":"Video: S\u0026P 500 Analyst Moves: NVDA","id":126563756,"image":"","related":"NVDA","source":"Market News Video","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=b5d1ee2c5b692ca969a362e02d81e5e668c737c1b1a7db3bb1ff78ee851ce8af"},{"category":"company","datetime":1710758820,"headline":"NVIDIA Achieves #21 Analyst Rank, Surpassing Alexandria Real Estate Equities","id":126563758,"image":"","related":"NVDA","source":"ETF Channel","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=875d689e7d72412846955ba837ce7c1fea67c90dfd0d03be13640c5596643f92"},{"category":"company","datetime":1710757140,"headline":"U.S. stocks have beaten European equities but won’t for much longer, says JPMorgan","id":126555190,"image":"","related":"NVDA","source":"MarketWatch","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=fcf4b096da2d27910de172aff89a9e46ed8b787e4fbed57afa06f88a2d5650bd"},{"category":"company","datetime":1710756120,"headline":"NVIDIA Corp (NVDA)'s Winning Formula: Financial Metrics and Competitive Strengths","id":126563761,"image":"","related":"NVDA","source":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=ca04c8deaa96d0c1568333d32e809537e8871d79bc58aa1a1e1d78e55a6f105b"},{"category":"company","datetime":1710756060,"headline":"New COVID-Like Outbreak 'Matter Of When, Not If,' WHO Director Warns As Scientists Race To Prepare Using Artificial Intelligence","id":126562444,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=1d69ef1a37ec9ff89ba856130ec6b58cbd90b674a862986d0107d19af16fdb2f"},{"category":"company","datetime":1710755580,"headline":"Why Is Verb Technology (VERB) Stock Up Again Today?","id":126557251,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=c8ddb7ba71d403d978874df1ab50c577865c374564a964f0ceec368855abd4b2"},{"category":"company","datetime":1710754860,"headline":"Nvidia launches an AI woodstock","id":126553849,"image":"","related":"NVDA","source":"Finnhub","summary":"On the week's agenda, amidst central bank decisions, investors have pinpointed an event that, before the artificial intelligence boom, would have federated only a microcosm. The Nvidia GTC conference,...","url":"https://finnhub.io/api/news?id=8f6733d8393e7c4fee962ca99560c513fcb71fa23b19c73e3403994c44438581"},{"category":"company","datetime":1710754740,"headline":"Market Clubhouse Morning Memo - March 18th, 2024 (Trade Strategy For SPY, QQQ, AAPL, MSFT, NVDA, GOOGL, META, And TSLA)","id":126555193,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=5104b8af109cc00ccc4ec1c2957eda690306639a905f6672df27bd6d1b10434c"},{"category":"company","datetime":1710754320,"headline":"Unveiling NVIDIA (NVDA)'s Value: Is It Really Priced Right? A Comprehensive Guide","id":126563766,"image":"","related":"NVDA","source":"GuruFocus","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=aa61c521039d78a5b8d6124c3b2700f86ad6967c3a7453ae33a45ffedf21c53a"},{"category":"company","datetime":1710753960,"headline":"Why Is Tilray (TLRY) Stock Up Today?","id":126557252,"image":"","related":"NVDA","source":"InvestorPlace","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=5a68789e94f05a3f880613e10e1c0580af8a97201abe37b4dfc4802b0f31c4eb"},{"category":"company","datetime":1710753540,"headline":"Google And Apple Surge On Ai News; Nvidia Eyes Growth With New Chip Unveilings","id":126555019,"image":"","related":"NVDA","source":"TalkMarkets","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=5fe56bd0eb43840ed05fabcba2b4c9f6c3ddeb4e28455511b10f245ad9d0ef84"},{"category":"company","datetime":1710753360,"headline":"Alphabet, Nvidia, PepsiCo And Other Big Stocks Moving Higher On Monday","id":126554926,"image":"","related":"NVDA","source":"Benzinga","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=d72a3c3432f68642bef0a08fdf982c7c29b56f8269ba46fc5ae9018e64b96ffc"},{"category":"company","datetime":1710753300,"headline":"Biggest stock movers today: NVDA, GOOG, FOUR and more","id":126555493,"image":"","related":"NVDA","source":"Seeking Alpha","summary":"Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results.","url":"https://finnhub.io/api/news?id=33d12dd2fb2023b806d3f2e8872f1f11fd4210d2577467258601f916c7646b9a"},{"category":"company","datetime":1710752120,"headline":"Wall St set to rise ahead of Fed meeting; Nvidia kicks off AI conference","id":126553484,"image":"","related":"NVDA","source":"Finnhub","summary":"* Nvidia AI developer conference kicks off with new chips infocus...","url":"https://finnhub.io/api/news?id=7fa42c15e804a3d792aa4c6d23798d07b3fd8153a131b877e4d4c13d3dad3f41"},{"category":"company","datetime":1710750600,"headline":"Fed March Meeting Policy Preview: Rate Hike, Pause, Or Cut","id":126553337,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2063396300/image_2063396300.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"S\u0026P 500 remains resilient amid inflation concerns and Fed rate pause. Check out why I believe that the Fed is unlikely to raise rates this Wednesday.","url":"https://finnhub.io/api/news?id=91fbc1fdf86d83359703cd3d1b74744ab2d84de48c1fa02e524420791a4fb828"},{"category":"company","datetime":1710749700,"headline":"When The Fed Will Likely Cut Rates","id":126553160,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1466601047/image_1466601047.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"The recent period of rising interest rates has presented a stiff challenge to my high-yield-focused investing strategy. Explore more details here.","url":"https://finnhub.io/api/news?id=92db0f3d3a72de0ea8817216b0263ddbc86f7a87eb3aa53c6ead89173532abfd"},{"category":"company","datetime":1710745118,"headline":"Astera Labs eyes valuation of up to $5.18 bln in upsized US IPO","id":126552721,"image":"","related":"NVDA","source":"Finnhub","summary":"Astera Labs said on Monday it wastargeting a valuation of up to $5.18 billion after it upsizedits U.S. initial public offering, as the chip firm looks to ridethe boom in artificial intelligence. ...","url":"https://finnhub.io/api/news?id=19a4a14bab49f4cb0d19f38fabeb8aacbb3b1000ecf99d77337e2cf246dd7e7b"},{"category":"company","datetime":1710744711,"headline":"March Madness: Final Four Investing Bracket 2024","id":126552674,"image":"https://media.gettyimages.com/id/1480105317/photo/close-up-image-of-basketball-ball-over-floor-in-the-gym-orange-basketball-ball-on-wooden.jpg?b=1\u0026s=170667a\u0026w=0\u0026k=20\u0026c=3a6SpR4T9p74cfKiPNm5UAnAXze8m-2fUu0Sq48yerw=","related":"NVDA","source":"SeekingAlpha","summary":"Learn how to make your investments thrive during March Madness, even if your college team didn't make it to the tournament.","url":"https://finnhub.io/api/news?id=5323cdb60336bbe51ba8255aa2b76cc31c8c3e124133f0dd9e69b5f29fee171e"},{"category":"company","datetime":1710744385,"headline":"More Big Changes To My Dividend Growth Portfolio","id":126552676,"image":"https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1072593728/image_1072593728.jpg?io=getty-c-w1536","related":"NVDA","source":"SeekingAlpha","summary":"I have been actively reshaping my portfolio by selling off low-conviction holdings and focusing on high-growth compounders. Explore more details here.","url":"https://finnhub.io/api/news?id=a13d09696002a7123655c57bdc03eca32fafb0a1f760387cb9dafab0e2b5e1dd"},{"category":"company","datetime":1710742062,"headline":"MORNING BID AMERICAS-Rates, oil lifted by China's green shoots","id":126552417,"image":"","related":"NVDA","source":"Finnhub","summary":"A look at the day ahead in U.S. and global markets from MikeDolanA rare positive surprise from Chinese industry and retail hasunnerved interest rate and energy markets some more,...","url":"https://finnhub.io/api/news?id=2df3209f3147516dfecdc3193c9c5c62266ccc7b3ec499ab35e434060ce7d618"}]